{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# Ouvrez un shell et exécuter ces commandes pxt extrait https:\/\/codethemicrobit.com\/@id@ cd @title @ code.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). L’expérience a une progression intégrée d’éditeur simple basé sur des blocs, grâce à l’éditeur de texte dans le navigateur avec robuste semi-automatique et automatique-fixation, tout le chemin à un perfectionnement intégrée environnement (",
  ", or":", ou",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/thumbnail\/1024\/Vimeo\/@args @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You pouvez partager vos scripts régulières sans signature in.<\/b> que vous suffit de vous connecter si vous souhaitez publier des packages (bibliothèques) à être utilisées par des tiers. Pour vous connecter, vous aurez besoin d'un compte GitHub, qui est réservé aux personnes 13 et plus.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "About":"Sur",
  "About PXT":"Sur PXT",
  "Block Editor":"Editeur de blocs",
  "Build your programming experience":"Construire votre expérience de la programmation",
  "CSV":"CSV",
  "Cancel":"Annuler",
  "Click on <b>Close &amp; Load<\/b>.":"Cliquez sur <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Cliquez sur <b>Data<\/b> » <b>New Query<\/b> » <b>From autres Sources<\/b> » <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Compatible avec <b>BBC micro : bit<\/b>",
  "Contact Us":"Contactez-nous",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Contrôler votre Kodu avec le micro : foret ! Vous pouvez contrôler les mouvements de caractère à l’aide de l’accéléromètre, sauter et tirer avec une presse de bouton, afficher des animations et défilement de texte à l’écran, interface avec les autres dispositifs via les broches e\/s et bien plus encore...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Créer un Workbook<\/b> de <b>Blank dans Excel 2016",
  "Do you need help installing the tools?":"Avez-vous besoin d’aide pour installer les outils ?",
  "Download Kodu!":"Télécharger Kodu !",
  "Edit":"Edit",
  "Edit in":"Modifier dans",
  "Embed":"Incorporer",
  "Enter the following URL and click on <b>Connect<\/b>.":"Saisissez l'URL suivante et cliquez sur <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Espace supplémentaire pour un appel à l'action à l'intérieur du pied de page qui pourrait aider à reprendre les utilisateurs.",
  "Follow these instructions!":"Suivez ces instructions !",
  "Footer Header":"Pied de page en-tête",
  "Get & Transform":"Get & Transform",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Démarrer avec un éditeur de code de drag&amp;drop amical de débutant.",
  "GitHub":"GitHub",
  "Group 1":"Groupe 1",
  "Group 2":"Groupe 2",
  "Group 3":"Groupe 3",
  "Houston, we have a problem.":"Houston, nous avons un problème.",
  "I Agree":"J'accepte",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Je consens à mon nom des utilisateur GitHub <b> @USERNAME@<\/b> qui accompagne n'importe quelle bibliothèque je publie",
  "I don't agree":"Je ne suis pas d'accord",
  "JSON":"JSON",
  "JavaScript Editor":"JavaScript Editor",
  "Kodu for micro:bit":"Kodu pour micro : peu",
  "Learn more":"Pour en savoir plus",
  "Link Four":"Lien vers quatre",
  "Link One":"Un lien",
  "Link Three":"Lien vers trois",
  "Link Two":"Lier deux",
  "Live data powered by":"Données de phase propulsées par",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Assurez-vous de que vous déconnectez de Facebook, Office 365, Microsoft ou Google, si vous êtes sur un ordinateur partagé.",
  "OK":"Bien",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - Identifiez-vous",
  "PXT - Signed out":"PXT - déconnecté",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"Les cibles PXT, dont une pour le micro de la BBC : bit, définissent un ensemble de blocs et APIs JavaScript disponibles aux utilisateurs. Enseignants et les développeurs peuvent étendre les objectifs existants par édition des colis ou des bibliothèques avec des blocs supplémentaires et d’API ainsi que construire complètement nouvelles cibles.",
  "Powered by PXT":"Propulsé par PXT",
  "Privacy & Cookies":"La vie privée & Cookies",
  "Programming Experience Toolkit":"Programmation expérience Toolkit",
  "Programming Experience Toolkit Logo":"Expérience de programmation Toolkit Logo",
  "Read the docs":"Lire les docs",
  "Report abuse":"Signaler un abus",
  "Report sent":"Rapport envoyé",
  "Sample":"Échantillon",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Sélectionnez <b>Anonymous<\/b> et cliquez sur <b>Connect<\/b>.",
  "Show me the sample!":"Montre-moi l'exemple !",
  "Sign in":"Connexion",
  "Start coding":"Commencer à coder",
  "Stream: @name@":"Flux : @name @",
  "Stream: @name@ \/@id@":"Flux : @name @ \/@id @",
  "Streaming data in Excel 2016":"Streaming de données dans Excel 2016",
  "Submit":"Envoyer",
  "Targets":"Cibles",
  "Terms Of Use":"Conditions d'utilisation",
  "Thank you for helping keep PXT a friendly place!":"Je vous remercie pour aider à garder PXT un endroit convivial !",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"Le Microsoft programmation expérience Toolkit (PXT) offre une expérience de programmation basée sur JavaScript (techniquement, un sous-ensemble de",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Le contenu ci-dessous est fourni par un utilisateur PXT et n'est pas approuvé par Microsoft. Si vous pensez que ce n'est pas approprié, s'il vous plaît",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Les données stockées dans ce cours d'eau peuvent facilement être importées dans une feuille de calcul Excel 2016 à l'aide",
  "Trademarks":"Marques de commerce",
  "TypeScript":"Texte dactylographié",
  "URL":"URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Mise à niveau vers JavaScript grâce à notre éditeur de texte enrichi avec une aide contextuelle, vérifications des antécédents et semi-automatique.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"PXT permet de fournir une expérience de codage lisse pour votre projet, en blocs et JavaScript. Construire l’API et le runtime et nous nous occuperons de l’étoffe de l’éditeur.",
  "User-provided content":"Contenu fourni par l'utilisateur",
  "Visual Studio Code":"Code de Visual Studio",
  "We collect your GitHub user name and will display it together with your libraries.":"Nous recueillons votre nom d'utilisateur de GitHub et il affichera ainsi que vos bibliothèques.",
  "We'll use your GitHub user name":"Nous allons utiliser votre nom d'utilisateur de GitHub",
  "Why do you find it offensive?":"Pourquoi trouvez-vous choquant ?",
  "You are now signed out from Programming Experience Toolkit":"Vous êtes maintenant déconnecté de programmation expérience Toolkit",
  "You can go back to":"Vous pouvez revenir à",
  "You can still create scripts and":"Vous pouvez toujours créer des scripts et",
  "code the micro:bit":"Code du micro : foret",
  "contact us":"Contactez-nous",
  "explore PXT":"Explorez PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/VI\/@args@\/hqdefault.jpg",
  "micro:bit":"micro : bit",
  "or":"ou",
  "pxt.io":"PXT.IO",
  "report abuse":"signaler un abus",
  "search docs...":"Rechercher des documents...",
  "sign in again":"Connectez-vous à nouveau",
  "to save scripts to all your devices.":"pour enregistrer les scripts à tous vos appareils.",
  "tutorial":"Tutorial",
  "view":"vue",
  "© 2016 Microsoft":"2016 Microsoft ©"
}