{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# open een shell en voer deze commando's jleavitt extract https:\/\/codethemicrobit.com\/@id@ cd @title @ code.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). De ervaring heeft een ingebouwde progressie van eenvoudige blok-gebaseerde editor, via in-browser text editor met robuuste auto-voltooiing en auto-vaststelling, helemaal naar een professionele geïntegreerd ontwikkeling omgeving (",
  ", or":", of",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/thumbnail\/1024\/Vimeo\/@args @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You kunt uw regelmatige scripts delen zonder ondertekening van in.<\/b> u alleen hoeft te melden als u wenst te publiceren van pakketten (bibliotheken) door anderen worden gebruikt. Als u wilt inloggen, moet u een GitHub-account, die alleen beschikbaar voor personen 13 en ouder is.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "About":"Over",
  "About PXT":"Over Jleavitt",
  "Block Editor":"Block Editor",
  "Build your programming experience":"Bouwen van uw programmeerervaring",
  "CSV":"CSV",
  "Cancel":"Annuleren",
  "Click on <b>Close &amp; Load<\/b>.":"Klik op <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Klik op <b>Data<\/b>» <b>New Query<\/b>» <b>From andere Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Compatibel met <b>BBC micro: bit<\/b>",
  "Contact Us":"Neem contact op met ons",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Control uw Kodu met de micro: bit! U kunt controle karakter beweging met behulp van de versnellingsmeter, springen en schieten met een druk op de knop, animaties weergeven en schuivende tekst op het scherm, interface met andere apparaten via de IO-pinnen, en nog veel meer...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Maken van een <b>Blank Workbook<\/b> in Excel 2016",
  "Do you need help installing the tools?":"Hebt u hulp bij de installatie van de hulpprogramma's nodig?",
  "Download Kodu!":"Download Kodu!",
  "Edit":"Bewerken",
  "Edit in":"Bewerken in",
  "Embed":"Insluiten",
  "Enter the following URL and click on <b>Connect<\/b>.":"Typ de volgende URL en klik op <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Extra ruimte voor een oproep tot actie in de voettekst die kan helpen bij het opnieuw engage gebruikers.",
  "Follow these instructions!":"Volg deze aanwijzingen!",
  "Footer Header":"Voettekst kop",
  "Get & Transform":"Get & transformatie",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Aan de slag met een beginner vriendelijke drag&amp;drop code-editor.",
  "GitHub":"GitHub",
  "Group 1":"Groep 1",
  "Group 2":"Groep 2",
  "Group 3":"Groep 3",
  "Houston, we have a problem.":"Houston, we hebben een probleem.",
  "I Agree":"Ik ga akkoord",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Ik geef toestemming voor mijn GitHub gebruiker naam <b> @USERNAME@<\/b> bij elke bibliotheek die ik publiceren",
  "I don't agree":"Ik ga niet akkoord",
  "JSON":"JSON",
  "JavaScript Editor":"JavaScript-Editor",
  "Kodu for micro:bit":"Kodu voor micro: beetje",
  "Learn more":"Meer informatie",
  "Link Four":"Vier koppelen",
  "Link One":"Een link",
  "Link Three":"Koppeling drie",
  "Link Two":"Link Two",
  "Live data powered by":"Live-gegevens wordt verzorgd door",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Zorg ervoor dat u zich afmeldt bij Office 365, Microsoft, Facebook en Google als je op een gedeelde computer.",
  "OK":"OK",
  "PXT":"JLEAVITT",
  "PXT - @name@":"Jleavitt - @name @",
  "PXT - @title@":"Jleavitt - @title @",
  "PXT - Sign in":"Jleavitt - inloggen",
  "PXT - Signed out":"Jleavitt - afgemeld",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"Een set blokken en JavaScript APIs beschikbaar definiëren Jleavitt streefcijfers, met inbegrip van een voor de BBC micro: bit, voor gebruikers. Docenten en ontwikkelaars kunnen uitbreiden van bestaande doelstellingen door publicerende pakketten of bibliotheken met extra blokken en API's, alsook bouwen van volledig nieuwe doelstellingen.",
  "Powered by PXT":"Powered by Jleavitt",
  "Privacy & Cookies":"Privacy & Cookies",
  "Programming Experience Toolkit":"Programmering ervaring Toolkit",
  "Programming Experience Toolkit Logo":"Programmering ervaring Toolkit Logo",
  "Read the docs":"Lees de de docs",
  "Report abuse":"Misbruik melden",
  "Report sent":"Verslag verzonden",
  "Sample":"Monster",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Selecteer <b>Anonymous<\/b> en klik op <b>Connect<\/b>.",
  "Show me the sample!":"Toon mij het monster!",
  "Sign in":"Aanmelden",
  "Start coding":"Beginnen met coderen",
  "Stream: @name@":"Stream: @name @",
  "Stream: @name@ \/@id@":"Stream: @name @ \/@id @",
  "Streaming data in Excel 2016":"Streaming gegevens in Excel 2016",
  "Submit":"Opslaan",
  "Targets":"Doelstellingen",
  "Terms Of Use":"Gebruiksvoorwaarden",
  "Thank you for helping keep PXT a friendly place!":"Dank u voor het helpen houden Jleavitt een vriendelijke plek!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"De Microsoft programmeren ervaring Toolkit (PXT) biedt een programmeerervaring gebaseerd rond (technisch, een subset van JavaScript",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"De onderstaande inhoud wordt verzorgd door een Jleavitt gebruiker, en wordt niet ondersteund door Microsoft. Als u denkt dat is het niet gepast, gelieve",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"De gegevens die zijn opgeslagen in deze stroom kunnen eenvoudig worden geïmporteerd in een spreadsheet Excel 2016 met behulp",
  "Trademarks":"Handelsmerken",
  "TypeScript":"Schrijfmachine",
  "URL":"URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Upgraden naar JavaScript dankzij onze rich text editor met contextafhankelijke help, achtergrondcontroles en auto-completion.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Gebruik Jleavitt om te zorgen voor een soepele codering ervaring voor uw project, in blokken en JavaScript. Bouwen van de API's en de runtime en wij zullen zorgen van de editor-spullen.",
  "User-provided content":"Gebruiker opgegeven inhoud",
  "Visual Studio Code":"Visual Studio Code",
  "We collect your GitHub user name and will display it together with your libraries.":"Wij verzamelen uw gebruikersnaam GitHub en zal weer te geven samen met uw bibliotheken.",
  "We'll use your GitHub user name":"We gebruiken uw gebruikersnaam GitHub",
  "Why do you find it offensive?":"Waarom vindt u het beledigend?",
  "You are now signed out from Programming Experience Toolkit":"U bent nu afgemeld van programmering ervaring Toolkit",
  "You can go back to":"U kunt teruggaan naar",
  "You can still create scripts and":"U kunt nog steeds het maken van scripts en",
  "code the micro:bit":"code van de micro: bits",
  "contact us":"Neem contact op met ons",
  "explore PXT":"verkennen van Jleavitt",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.YouTube.com\/VI\/@args@\/hqdefault.jpg",
  "micro:bit":"Micro: bits",
  "or":"of",
  "pxt.io":"PXT.io",
  "report abuse":"misbruik melden",
  "search docs...":"docs Search …",
  "sign in again":"opnieuw inloggen",
  "to save scripts to all your devices.":"scripts om op te slaan al uw apparaten.",
  "tutorial":"tutorial",
  "view":"weergave",
  "© 2016 Microsoft":"© 2016 Microsoft"
}