{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# bir kabuğu'nu açın ve pxt ayıklamak kodu @ https:\/\/codethemicrobit.com\/@id@ cd @title bu komutları çalıştırın.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). Tecrübeli bir profesyonel entegre geliştirme environemnt (sonuna kadar güçlü auto-ikmal ve auto-sabitleme, tarayıcıda metin düzenleyicisiyle aracılığıyla blok tabanlı basit editörü yerleşik bir ilerleme",
  ", or":", veya",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/thumbnail\/1024\/Vimeo\/@args @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You başkaları tarafından kullanılmak üzere paketleri (kitaplıklar) yayımlamak istiyorsanız, oturum açmak için yeterlidir in.<\/b> imza olmadan normal komut dosyalarınızı paylaşabilirsiniz. Oturum açmak için sadece 13 ve üzeri kişilere mevcuttur GitHub hesabı gerekir.",
  "@name@ \/@id@":"@name \/@id @ @",
  "@title@ @byuser@":"@title @byuser @ @",
  "About":"Hakkında",
  "About PXT":"PXT hakkında",
  "Block Editor":"Blok düzenleyici",
  "Build your programming experience":"Programlama deneyimi oluşturmak",
  "CSV":"CSV",
  "Cancel":"İptal",
  "Click on <b>Close &amp; Load<\/b>.":"<b>Close &amp; Load<\/b> üzerinde'yi tıklatın.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"<b>New Query<\/b> <b>Data<\/b> üzerinde tıklayınız»» <b>From diğer Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"<b>BBC mikro: bit<\/b> ile uyumlu",
  "Contact Us":"Bize ulaşın",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Mikro: bit Kodu kontrol! Accelerometer kullanarak karakter hareketi kontrol, atlamak ve bir düğmeye basarak ateş, animasyonlar görüntüleyebilir ve kayan metin ekranında, g\/ç pimleri ve çok daha fazlası diğer cihazları ile arayüz...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Excel 2016 yılında <b>Blank Workbook<\/b> oluşturmak",
  "Do you need help installing the tools?":"Araçlarını yükleme yardım ister misin?",
  "Download Kodu!":"Kodu indir!",
  "Edit":"Düzenle",
  "Edit in":"Düzenleme",
  "Embed":"Katıştır",
  "Enter the following URL and click on <b>Connect<\/b>.":"Aşağıdaki URL'yi girin ve <b>Connect<\/b> üzerinde'yi tıklatın.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Kullanıcıların yeniden meşgul yardımcı olabilir altbilgi içinde eylem çağrısı için fazladan alan.",
  "Follow these instructions!":"Bu yönergeleri izleyin!",
  "Footer Header":"Altbilgi üstbilgi",
  "Get & Transform":"Get ve dönüşüm",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Bir acemi dostu drag&amp;drop Kod Düzenleyicisi ile başlamak.",
  "GitHub":"GitHub",
  "Group 1":"Grup 1",
  "Group 2":"Grup 2",
  "Group 3":"Grup 3",
  "Houston, we have a problem.":"Houston, bir sorunumuz var.",
  "I Agree":"Kabul Ediyorum",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Benim GitHub kullanıcı adı <b> @ ben yayınlamak herhangi bir kütüphane eşlik eden USERNAME@<\/b> için izin",
  "I don't agree":"Ben aynı fikirde değilim",
  "JSON":"JSON",
  "JavaScript Editor":"JavaScript editörü",
  "Kodu for micro:bit":"Kodu için mikro: gem",
  "Learn more":"Daha fazla bilgi edinin",
  "Link Four":"Dört bağlantı",
  "Link One":"Bir bağlantı...",
  "Link Three":"Üç bağlantı",
  "Link Two":"İki bağlantı",
  "Live data powered by":"Canlı veri powered by",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Paylaşılan bir bilgisayarda iseniz Facebook, Office 365, Microsoft veya Google dışarı oturum emin olun.",
  "OK":"Tamam",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - oturum açma",
  "PXT - Signed out":"PXT - oturum kapatıldı",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"PXT hedefleri, BBC micro: bit, da dahil olmak üzere kullanıcılara blokları ve JavaScript API kullanılabilir bir kümesini tanımlar. Öğretmenler ve geliştiriciler tarafından yayımlama paketleri veya kitaplıkları ek bloklar ve API'ları ile varolan hedefleri genişletmek yayılımının tamamen yeni hedefler oluşturmak.",
  "Powered by PXT":"PXT tarafından desteklenmektedir",
  "Privacy & Cookies":"Gizlilik ve tanımlama bilgileri",
  "Programming Experience Toolkit":"Programlama deneyimi Toolkit",
  "Programming Experience Toolkit Logo":"Programlama deneyimi Toolkit Logo",
  "Read the docs":"Docs okumak",
  "Report abuse":"Bildir",
  "Report sent":"Gönderilen rapor",
  "Sample":"Örnek",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"<b>Anonymous<\/b> seçin ve <b>Connect<\/b> tıklatın.",
  "Show me the sample!":"Örnek göster bana!",
  "Sign in":"Oturum Aç",
  "Start coding":"Kodlama başlatın",
  "Stream: @name@":"Akış: @name @",
  "Stream: @name@ \/@id@":"Akış: @name \/@id @ @",
  "Streaming data in Excel 2016":"Akış verileri Excel 2016 yılında",
  "Submit":"Gönder",
  "Targets":"Hedefler",
  "Terms Of Use":"Kullanım Şartları",
  "Thank you for helping keep PXT a friendly place!":"PXT bir dost bir yer tutmak yardımcı olduğunuz için teşekkür ederiz!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"Microsoft programlama deneyimi Toolkit (PXT) JavaScript (teknik olarak, bir alt kümesini tabanlı bir programlama deneyimi sağlar",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Aşağıdaki içerik PXT kullanıcı tarafından sağlanan ve Microsoft tarafından onaylanan değil. Eğer düşünüyorsanız lütfen uygun değil",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Bu akış içinde depolanan veriler bir Excel 2016 elektronik tablo kullanarak kolayca alınabilir",
  "Trademarks":"Ticari markalar",
  "TypeScript":"Patlama",
  "URL":"URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Bizim zengin metin editörü bağlamsal yardım, arka plan kontrolleri ve otomatik tamamlama ile sayesinde JavaScript-e doğru yükseltmek.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"PXT blokları ve JavaScript projeniz için düzgün bir kodlama deneyimi sağlamak için kullanın. API'ları ve çalışma zamanı ve Editör şeyler ilgileneceğiz.",
  "User-provided content":"Kullanıcı tarafından sağlanan içeriği",
  "Visual Studio Code":"Visual Studio kod",
  "We collect your GitHub user name and will display it together with your libraries.":"GitHub kullanıcı adınızı toplar ve o-ecek göstermek senin kitaplıkları ile birlikte.",
  "We'll use your GitHub user name":"Biz GitHub kullanıcı adınızı kullanacağız",
  "Why do you find it offensive?":"Neden saldırgan bulabilirim?",
  "You are now signed out from Programming Experience Toolkit":"Sen şimdi programlama deneyimi alet--dan imzalanır",
  "You can go back to":"Geri gidebilirsiniz",
  "You can still create scripts and":"Hala komut dosyaları oluşturmak ve",
  "code the micro:bit":"kod mikro: bit",
  "contact us":"bize ulaşın",
  "explore PXT":"PXT keşfetmek",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/vi\/@args@\/hqdefault.jpg",
  "micro:bit":"Mikro: bit",
  "or":"veya",
  "pxt.io":"PXT.io",
  "report abuse":"bildir",
  "search docs...":"Arama Dokümanlar...",
  "sign in again":"yeniden oturum açın",
  "to save scripts to all your devices.":"Tüm cihazlar için komut dosyaları kurtarmak için.",
  "tutorial":"öğretici",
  "view":"Görünüm",
  "© 2016 Microsoft":"© 2016 Microsoft"
}