{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# obrir un intèrpret d'ordres i executeu aquestes ordres pxt extracte https:\/\/codethemicrobit.com\/@id@ cd @title @ codi.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). L'experiència té una progressió predefinit de bloc basat en simple editor, a través d'editor de text dins navegador amb acabament auto robust i la auto-fixació, tot el camí a un desenvolupament professional integrat environemnt (",
  ", or":", o",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/thumbnail\/1024\/Vimeo\/@ARGS @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You pot compartir els scripts regulars sense signar només cal signar dins si voleu publicar paquets (biblioteques) per ser utilitzats per altres in.<\/b>. Per iniciar la sessió, necessitarà un compte GitHub, que només està disponible per a persones majors i 13.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "About":"Sobre",
  "About PXT":"Sobre PXT",
  "Block Editor":"Editor de bloc",
  "Build your programming experience":"Construir la seva experiència de programació",
  "CSV":"CSV",
  "Cancel":"Cancel·la",
  "Click on <b>Close &amp; Load<\/b>.":"Feu clic a <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Feu clic a <b>Data<\/b>» <b>New Query<\/b>» <b>From altres Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Compatible amb <b>BBC Microordinador: bit<\/b>",
  "Contact Us":"Contacti amb nosaltres",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Controlar el seu Kodu amb el Microordinador: bit! Vostè pot controlar el moviment de caràcter utilitzant l'acceleròmetre, saltar i disparar amb una premsa de botons, Visualitza les animacions i moure text en pantalla, la interfície amb altres dispositius a través d'els pins IO i molt més...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Crear un Workbook<\/b> <b>Blank en Excel 2016",
  "Do you need help installing the tools?":"Necessita ajuda per instal·lar les eines?",
  "Download Kodu!":"Descarregui Kodu!",
  "Edit":"Editar",
  "Edit in":"Edita-ho a",
  "Embed":"Incrustar",
  "Enter the following URL and click on <b>Connect<\/b>.":"Introduïu l'URL següent i feu clic a <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Espai extra per a una trucada a l'acció dins de peu de pàgina que podria ajudar a tornar a participar als usuaris.",
  "Follow these instructions!":"Segueix aquestes instruccions!",
  "Footer Header":"Capçalera de peu de pàgina",
  "Get & Transform":"Aconseguir transformar 59",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Començar amb un editor de codi drag&amp;drop agradable de principiant.",
  "GitHub":"GitHub",
  "Group 1":"Grup 1",
  "Group 2":"Grup 2",
  "Group 3":"Grup 3",
  "Houston, we have a problem.":"Houston, tenim un problema.",
  "I Agree":"Estic d'acord",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Jo de consentiment meu GitHub usuari nom <b> @USERNAME@<\/b> que acompanya qualsevol biblioteca que publico",
  "I don't agree":"No accepto",
  "JSON":"JSON",
  "JavaScript Editor":"JavaScript Editor",
  "Kodu for micro:bit":"Kodu Microordinador: mica",
  "Learn more":"Més informació",
  "Link Four":"Enllaç quatre",
  "Link One":"Un enllaç",
  "Link Three":"Enllaç tres",
  "Link Two":"Enllaçar dos",
  "Live data powered by":"Impulsat per les dades en directe",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Assegurar-se que entrar al Facebook, Office 365, Microsoft o Google si estàs en un ordinador compartit.",
  "OK":"Correcte",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - senyal en",
  "PXT - Signed out":"PXT - la sessió de",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"Objectius PXT, incloent-hi un per la BBC micro: mica, definir un conjunt de blocs i JavaScript APIs disponible als usuaris. Professors i desenvolupadors poden ampliar els objectius existents per editorial paquets o biblioteques amb altres blocs i API com construir completament noves dianes.",
  "Powered by PXT":"Desenvolupat per PXT",
  "Privacy & Cookies":"Privacitat 59 galetes",
  "Programming Experience Toolkit":"Programació experiència Toolkit",
  "Programming Experience Toolkit Logo":"Programació experiència Toolkit Logo",
  "Read the docs":"Llegir la documentació",
  "Report abuse":"Reportar abús",
  "Report sent":"Informe enviat",
  "Sample":"Mostra",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"<b>Connect<\/b> <b>Anonymous<\/b> i fer clic selecte.",
  "Show me the sample!":"Mostra'm la Mostra!",
  "Sign in":"Inicia la sessió",
  "Start coding":"Començar la codificació",
  "Stream: @name@":"Corrent: @name @",
  "Stream: @name@ \/@id@":"Corrent: @name @ \/@id @",
  "Streaming data in Excel 2016":"Transmissió de dades en Excel 2016",
  "Submit":"Presentar",
  "Targets":"Objectius",
  "Terms Of Use":"Condicions d'ús",
  "Thank you for helping keep PXT a friendly place!":"Gràcies per ajudar a mantenir a PXT un lloc amable!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"El Microsoft programació experiència Toolkit (PXT) ofereix una experiència de programació basat en JavaScript (tècnicament, un subconjunt de",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"El contingut següent és proporcionada per un usuari PXT i no està recolzat per Microsoft. Si creus que no és adequat, si us plau",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Les dades emmagatzemades en aquest corrent poden ser fàcilment importats a un ús de full de càlcul Excel 2016",
  "Trademarks":"Marques registrades",
  "TypeScript":"Resultant",
  "URL":"URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Actualitzar a JavaScript gràcies a nostre editor de text enriquit amb l'ajuda contextual, controls d'antecedents i acabament auto.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Utilitzar PXT per proporcionar una experiència de codificació suau per al seu projecte en blocs i JavaScript. Construir l'API i el temps d'execució i nosaltres ens encarregarem de la matèria de l'editor.",
  "User-provided content":"Contingut proporcionat d'usuari",
  "Visual Studio Code":"Codi Visual Studio",
  "We collect your GitHub user name and will display it together with your libraries.":"Apleguem nom d'usuari GitHub i mostrarà juntament amb les seves biblioteques.",
  "We'll use your GitHub user name":"Farem servir el seu nom d'usuari GitHub",
  "Why do you find it offensive?":"Per què li resulta ofensiu?",
  "You are now signed out from Programming Experience Toolkit":"Ara els signés fora de programació experiència Toolkit",
  "You can go back to":"Vostè pot tornar a",
  "You can still create scripts and":"Vostè encara pot crear seqüències d'ordres i",
  "code the micro:bit":"codi el Microordinador: bit",
  "contact us":"Contacti amb nosaltres",
  "explore PXT":"explorar PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg",
  "micro:bit":"Microordinador: mica",
  "or":"o",
  "pxt.io":"pxt.io",
  "report abuse":"reportar abús",
  "search docs...":"Cerca de documents...",
  "sign in again":"la sessió",
  "to save scripts to all your devices.":"salvar escriptures a tots els dispositius.",
  "tutorial":"tutorial",
  "view":"veure",
  "© 2016 Microsoft":"© 2016 Microsoft"
}