{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# відкрити оболонки і виконання цих команд, pxt екстракт https:\/\/codethemicrobit.com\/@id@ cd @title @ код.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). Досвід має вбудований прогресії від простий блок основаних редактор, через в браузері текстовий редактор з надійною авто доповнення та авто закріплення, аж до професійних комплексного розвитку environemnt (",
  ", or":", або",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/thumbnail\/1024\/Vimeo\/@ARGS @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You можна спільно використовувати регулярні скриптів без підписання in.<\/b>, вам потрібно тільки, якщо ви хочете опублікувати пакунки (бібліотек) для використання іншими користувачами. Щоб увійти, потрібно GitHub рахунку, що надається лише особам, 13 і старше.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "About":"Про",
  "About PXT":"Про PXT",
  "Block Editor":"Редактор блоків",
  "Build your programming experience":"Побудувати ваш досвід програмування",
  "CSV":"CSV",
  "Cancel":"\"Скасувати\"",
  "Click on <b>Close &amp; Load<\/b>.":"Натисніть на <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Натисніть на <b>Data<\/b>» <b>New Query<\/b>» <b>From інші Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Сумісний із <b>BBC мікро: bit<\/b>",
  "Contact Us":"Зв'язатися з нами",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Контролювати ваш Kodu з мікро: біт! Ви можете керувати символу руху за допомогою акселерометра, стрибати і стріляти з натискання кнопки, відображати анімацію та прокручування тексту на екрані, взаємодіяти з іншими пристроями через IO шпильки і багато іншого...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Створення <b>Blank Workbook<\/b> в Excel 2016",
  "Do you need help installing the tools?":"Вам потрібна допомога, встановивши інструменти якими?",
  "Download Kodu!":"Завантажити Kodu!",
  "Edit":"Редагувати",
  "Edit in":"Редагувати в",
  "Embed":"Вбудувати",
  "Enter the following URL and click on <b>Connect<\/b>.":"Введіть URL-адресою та натисніть <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Додатковий простір для заклик до дії всередині нижнього колонтитула, які могли б допомогти відновити співпрацю користувачів.",
  "Follow these instructions!":"Дотримуйтеся наведених інструкцій!",
  "Footer Header":"Нижній колонтитул заголовка",
  "Get & Transform":"Отримати & трансформування",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Розпочати роботу з початківців дружні drag&amp;drop коду редактором.",
  "GitHub":"GitHub",
  "Group 1":"Група 1",
  "Group 2":"Група 2",
  "Group 3":"Група 3",
  "Houston, we have a problem.":"Х'юстон, у нас є проблема.",
  "I Agree":"Погоджуюся",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Я згода на мій GitHub користувача ім'я <b> @USERNAME@<\/b> супроводжують будь-якої бібліотеки я опублікувати",
  "I don't agree":"Я не згоден",
  "JSON":"JSON",
  "JavaScript Editor":"JavaScript редактор",
  "Kodu for micro:bit":"Kodu для мікро: бітова",
  "Learn more":"Дізнатися більше",
  "Link Four":"Зв'язати чотири",
  "Link One":"Зв'язати один",
  "Link Three":"Три посилання",
  "Link Two":"Зв'язати два",
  "Live data powered by":"Жити дані на харчування від",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Переконайтеся, що ви вийдете з Facebook, Office 365, Microsoft або Google, якщо ви на спільно використовуваному комп'ютері.",
  "OK":"Гаразд",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - увійти",
  "PXT - Signed out":"PXT - сеанс завершено",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"PXT цілей, в тому числі один за BBC мікро: бітова, визначають комплекс блоків і JavaScript API доступна користувачам. Вчителів і розробники можуть розширити існуючі цілі, видавничий пакунки або нові блоки та API для бібліотеки, а також створювати повністю нові цілі.",
  "Powered by PXT":"Живлення від PXT",
  "Privacy & Cookies":"Політики конфіденційності & печиво",
  "Programming Experience Toolkit":"Інструментарій досвід програмування",
  "Programming Experience Toolkit Logo":"Програмування досвід інструментарій логотип",
  "Read the docs":"Читати документи",
  "Report abuse":"Повідомити про порушення",
  "Report sent":"Звіт надіслано",
  "Sample":"Зразок",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Виберіть <b>Anonymous<\/b> і натисніть кнопку <b>Connect<\/b>.",
  "Show me the sample!":"Покажіть мені зразок!",
  "Sign in":"Ввійти",
  "Start coding":"Почати кодування",
  "Stream: @name@":"Потік: @name @",
  "Stream: @name@ \/@id@":"Потік: @name @ \/@id @",
  "Streaming data in Excel 2016":"Потокове передавання даних в Excel 2016",
  "Submit":"Представити",
  "Targets":"Цілі",
  "Terms Of Use":"Умови використання",
  "Thank you for helping keep PXT a friendly place!":"Дякуємо вам за допомогу, тримати PXT на дружнє місце!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"У Microsoft програмування досвід Toolkit (PXT) забезпечує досвіду програмування, заснована на JavaScript (технічно, підмножини",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Вміст нижче передбачено PXT користувач а не схвалені Microsoft. Якщо ви вважаєте, що це не є доцільним, будь ласка",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Дані, що зберігаються в цім потоці легко підтримується в Excel 2016 електронної таблиці за допомогою",
  "Trademarks":"Товарні знаки",
  "TypeScript":"Машинопис",
  "URL":"URL-АДРЕСА",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Оновлення до JavaScript завдяки нашим текстовий редактор з контекстної довідки, біографічних та авто доповнення.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Використовувати PXT, щоб забезпечити плавний кодування досвід для вашого проекту, на блоки і JavaScript. Побудувати на API для і виконання, і ми подбаємо редактор матеріалу.",
  "User-provided content":"Користувачем надані права",
  "Visual Studio Code":"Код Visual Studio",
  "We collect your GitHub user name and will display it together with your libraries.":"Ми збираємо ім'я користувача GitHub і відобразить його разом з вашої бібліотеки.",
  "We'll use your GitHub user name":"Ми будемо використовувати ім'я користувача GitHub",
  "Why do you find it offensive?":"Чому ви знайдете образливими?",
  "You are now signed out from Programming Experience Toolkit":"Ви зараз вийшли з програмування досвід інструментарій",
  "You can go back to":"Ви можете повернутися",
  "You can still create scripts and":"Ви можете створити сценарії та",
  "code the micro:bit":"код мікро: бітова",
  "contact us":"зв'язатися з нами",
  "explore PXT":"дослідити PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"HTTPS:\/\/IMG.YouTube.com\/VI\/@ARGS@\/hqdefault.jpg",
  "micro:bit":"Micro: бітова",
  "or":"або",
  "pxt.io":"pxt.io",
  "report abuse":"повідомити про порушення",
  "search docs...":"Пошук документів...",
  "sign in again":"ввійдіть знову",
  "to save scripts to all your devices.":"щоб зберегти скрипти на всіх пристроях.",
  "tutorial":"Підручник",
  "view":"подання",
  "© 2016 Microsoft":"© 2016 Microsoft"
}