{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# فتح قذيفة وتشغيل هذه الأوامر بكست استخراج مؤتمر نزع السلاح https:\/\/codethemicrobit.com\/@id@ @title @ التعليمات البرمجية.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). التجربة قد تقدم مدمج من محرر المستندة إلى كتلة بسيطة، من خلال محرر النص في المستعرض مع الإكمال التلقائي قوية وإصلاح السيارات، وصولاً إلى (البيئة مهنية تنمية المتكاملة",
  ", or":"، أو",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/thumbnail\/1024\/vimeo\/@ARGS @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"يمكن مشاركة <b>You النصية العادية دون توقيع in.<\/b> تحتاج فقط إلى تسجيل الدخول إذا كنت ترغب في نشر حزم (المكتبات) يتم استخدامها من قبل الآخرين. سوف تحتاج لتسجيل الدخول، على حساب GitHub، التي لا تتوفر إلا للأشخاص 13 وكبار السن.",
  "@name@ \/@id@":"@name @\/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "About":"حول",
  "About PXT":"حول بكست",
  "Block Editor":"محرر كتلة",
  "Build your programming experience":"بناء الخاصة بك تجربة البرمجة",
  "CSV":"CSV",
  "Cancel":"إلغاء الأمر",
  "Click on <b>Close &amp; Load<\/b>.":"انقر فوق <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Web<\/b> <b>From Query<\/b> <b>New فوق <b>Data<\/b>»» <b>From أخرى Sources<\/b>».",
  "Compatible with <b>BBC micro:bit<\/b>":"متوافق مع <b>BBC الصغيرة: bit<\/b>",
  "Contact Us":"اتصل بنا",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"التحكم الخاص بك رمز مع الصغرى: البت! يمكنك التحكم في حركة الحرف باستخدام مقياس التسارع، والقفز وإطلاق النار مع زر صحافة، وعرض الرسوم المتحركة التمرير النص على الشاشة، والتفاعل مع الأجهزة الأخرى عن طريق دبابيس الإعلام والتوعية، وأكثر من ذلك بكثير...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"إنشاء Workbook<\/b> <b>Blank حلول عام Excel 2016",
  "Do you need help installing the tools?":"هل تحتاج إلى مساعدة في تثبيت الأدوات؟",
  "Download Kodu!":"تحميل رمز!",
  "Edit":"تحرير",
  "Edit in":"تحرير في",
  "Embed":"تضمين",
  "Enter the following URL and click on <b>Connect<\/b>.":"أدخل URL التالي ثم انقر فوق <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"الحصول على مساحة إضافية لدعوة إلى العمل داخل تذييل الصفحة التي يمكن أن تساعد في إعادة إشراك المستخدمين.",
  "Follow these instructions!":"اتبع هذه التعليمات!",
  "Footer Header":"رأس تذييل الصفحة",
  "Get & Transform":"الحصول على تحويل &",
  "Get started with a beginner friendly drag&amp;drop code editor.":"البدء باستخدام محرر التعليمات برمجية drag&amp;drop ودية المبتدئين.",
  "GitHub":"GitHub",
  "Group 1":"المجموعة 1",
  "Group 2":"المجموعة 2",
  "Group 3":"المجموعة 3",
  "Houston, we have a problem.":"هيوستن، لدينا مشكلة.",
  "I Agree":"أوافق",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"أنا موافقة بلادي GitHub المستخدم اسم <b> @USERNAME@<\/b> المصاحبة لأي مكتبة نشر",
  "I don't agree":"لا أوافق",
  "JSON":"JSON",
  "JavaScript Editor":"محرر جافا سكريبت",
  "Kodu for micro:bit":"رمز للصغير: بت",
  "Learn more":"التعرف على المزيد",
  "Link Four":"ربط أربعة",
  "Link One":"وصلة واحدة",
  "Link Three":"ربط ثلاثة",
  "Link Two":"ربط اثنين",
  "Live data powered by":"بيانات حية بواسطة",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"تأكد من تسجيل الخروج من فيس بوك أو Office 365، مايكروسوفت أو جوجل إذا كنت على جهاز كمبيوتر مشترك.",
  "OK":"موافق",
  "PXT":"بكست",
  "PXT - @name@":"بكست-@name @",
  "PXT - @title@":"بكست-@title @",
  "PXT - Sign in":"بكست-تسجيل الدخول",
  "PXT - Signed out":"بكست-تسجيل الخروج",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"أهداف بكست، بما في ذلك واحد للدقيقة ال بي بي سي: البت، تحديد مجموعة من كتل وجافا سكريبت واجهات برمجة التطبيقات المتاحة للمستخدمين. المعلمين والمطورين ويمكن توسيع الأهداف الحالية بحزم النشر أو المكتبات مع قوالب إضافية وواجهات برمجة التطبيقات، فضلا عن بناء أهداف جديدة تماما.",
  "Powered by PXT":"بواسطة بكست",
  "Privacy & Cookies":"الخصوصية & ملفات تعريف الارتباط",
  "Programming Experience Toolkit":"أدوات تجربة البرمجة",
  "Programming Experience Toolkit Logo":"شعار مجموعة الأدوات تجربة البرمجة",
  "Read the docs":"قراءة المستندات",
  "Report abuse":"الإبلاغ عن إساءة",
  "Report sent":"إرسال تقرير",
  "Sample":"عينة",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"حدد <b>Anonymous<\/b> ثم انقر فوق <b>Connect<\/b>.",
  "Show me the sample!":"تبين لي العينة!",
  "Sign in":"تسجيل الدخول",
  "Start coding":"بدء الترميز",
  "Stream: @name@":"تيار: @name @",
  "Stream: @name@ \/@id@":"تيار: @name @\/@id @",
  "Streaming data in Excel 2016":"تدفق البيانات في Excel 2016",
  "Submit":"إرسال",
  "Targets":"أهداف",
  "Terms Of Use":"شروط الاستخدام",
  "Thank you for helping keep PXT a friendly place!":"شكرا لك للمساعدة في الحفاظ على بكست مكان ودية!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"Microsoft برمجة تجربة مجموعة الأدوات (بكست) يوفر تجربة برمجة القائمة على جافا سكريبت (من الناحية التقنية، مجموعة فرعية من",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"المحتوى أدناه يتم توفيرها من قبل مستخدم بكست، وليست معتمدة من Microsoft. إذا كنت تعتقد أنه من غير المناسب، يرجى",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"يمكن بسهولة استيراد البيانات المخزنة في هذا الدفق إلى استخدام جدول بيانات Excel 2016",
  "Trademarks":"العلامات التجارية",
  "TypeScript":"تيبيسكريبت",
  "URL":"عنوان URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"الترقية إلى جافا سكريبت بفضل لدينا محرر نص منسق مع التعليمات السياقية وخلفياتهم والإكمال التلقائي.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"استخدام بكست لتوفير تجربة ترميز سلس للمشروع الخاص بك، في كتل وجافا سكريبت. بناء واجهات برمجة التطبيقات ووقت التشغيل ونحن سوف تتخذ الرعاية من الأشياء محرر.",
  "User-provided content":"المحتويات المقدمة من قبل المستخدم",
  "Visual Studio Code":"رمز visual Studio",
  "We collect your GitHub user name and will display it together with your libraries.":"نقوم بجمع اسم المستخدم الخاص بك GitHub وسيتم عرضها جنبا إلى جنب مع المكتبات الخاصة بك.",
  "We'll use your GitHub user name":"ونحن سوف تستخدم اسم المستخدم GitHub",
  "Why do you find it offensive?":"لماذا تجد أنها هجومية؟",
  "You are now signed out from Programming Experience Toolkit":"يتم الآن تسجيل خروجك من \"تجربة أدوات البرمجة\"",
  "You can go back to":"يمكنك العودة إلى",
  "You can still create scripts and":"لا يزال يمكنك إنشاء برامج نصية و",
  "code the micro:bit":"المدونة الصغرى: بت",
  "contact us":"اتصل بنا",
  "explore PXT":"استكشاف بكست",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg",
  "micro:bit":"الصغرى: بت",
  "or":"أو",
  "pxt.io":"pxt.io",
  "report abuse":"الإبلاغ عن إساءة",
  "search docs...":"البحث عن مستندات...",
  "sign in again":"قم بتسجيل الدخول مرة أخرى",
  "to save scripts to all your devices.":"لحفظ البرامج النصية إلى جميع الأجهزة الخاصة بك.",
  "tutorial":"البرنامج التعليمي",
  "view":"طريقة العرض",
  "© 2016 Microsoft":"موقع Microsoft 2016"
}