{
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). Die Erfahrung hat eine integrierte Entwicklung vom einfachen Block-basierten Editor durch in-Browser Text-Editor mit robusten Autovervollständigung und Auto-Befestigung, bis hin zu einem integrierten Weiterbildung Environemnt (",
  ", or":", oder",
  "\/@id@":"\/@id bei",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/Thumbnail\/1024\/Vimeo\/@args bei",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You können Ihre regelmäßigen Skripts freigeben, ohne Anmeldung in.<\/b> benötigen Sie nur anmelden, wenn Sie Pakete (Bibliotheken) von anderen Benutzern verwendet werden veröffentlichen möchten. Um sich anzumelden, benötigen Sie ein GitHub Konto, das nur Personen 13 und älter ist.",
  "@name@ \/@id@":"@name bei \/@id bei",
  "@title@ @byuser@":"@title bei @byuser bei",
  "About":"Über",
  "BBC micro:bit":"BBC Micro: bit",
  "Block Editor":"Block-Editor",
  "Build your own packages":"Bauen Sie Ihre eigenen Pakete",
  "Build your own targets":"Erstellen von eigenen Zielen",
  "CSV":"CSV",
  "Cancel":"Abbrechen",
  "Click on <b>Close &amp; Load<\/b>.":"Klicken Sie auf <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Klicken Sie auf <b>Data<\/b>» <b>New Query<\/b>» <b>From andere Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Kompatibel mit <b>BBC Mikro: bit<\/b>",
  "Contact Us":"Kontaktieren Sie uns",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Kontrollieren Sie Ihre Kodu mit dem Mikro: Bit! Sie können Charakter Bewegungen mit dem Beschleunigungssensor steuern, springen und schießen mit einem Tastendruck, Animationen anzeigen und Text auf dem Bildschirm scrollen Schnittstelle mit anderen Geräten über die IO-Pins und vieles mehr...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Erstellen Sie eine <b>Blank-Workbook<\/b> in Excel 2016",
  "Download Kodu!":"Kodu herunterladen!",
  "Embed":"Einbinden",
  "Enter the following URL and click on <b>Connect<\/b>.":"Geben Sie den folgenden URL, und klicken Sie auf <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Extra Platz für ein Aufruf zum Handeln in der Fußzeile, mit die Hilfe Benutzer erneut zu engagieren.",
  "Footer Header":"Fußzeile Kopfzeile",
  "Fork":"Gabel",
  "Get & Transform":"Erhalten & Transform",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Einstieg mit einem Anfänger-freundlich drag&amp;drop-Code-Editor.",
  "GitHub":"GitHub",
  "Group 1":"Gruppe 1",
  "Group 2":"Gruppe 2",
  "Group 3":"Gruppe 3",
  "Hint":"Hinweis",
  "Houston, we have a problem.":"Houston, wir haben ein Problem.",
  "I Agree":"Ich stimme zu",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Ich bin einverstanden mit meinem GitHub Benutzer Name <b> @USERNAME@<\/b> begleiten jede Bibliothek veröffentliche ich",
  "I don't agree":"Ich bin einverstanden nicht",
  "JSON":"JSON",
  "JavaScript Editor":"JavaScript-Editor",
  "Kodu for micro:bit":"Kodu für Mikro: bit",
  "Link Four":"Link vier",
  "Link One":"Verknüpfen eines",
  "Link Three":"Verbindung der drei",
  "Link Two":"Verknüpfen Sie zwei",
  "Live data powered by":"Angetrieben von Live-Daten",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Stellen Sie sicher, dass Sie aus Facebook, Office 365, Microsoft oder Google anmelden, wenn Sie auf einem gemeinsam genutzten Computer.",
  "Microsoft Programming Experience Toolkit (PXT)":"Microsoft Programmierung Erfahrung Toolkit (PXT)",
  "OK":"Okay",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name bei",
  "PXT - @title@":"PXT - @title bei",
  "PXT - Sign in":"PXT - anmelden",
  "PXT - Signed out":"PXT - abgemeldet",
  "PXT for BBC micro:bit":"PXT für BBC Micro: bit",
  "PXT supports a modern packaging system that allows developer to add their own blocks and JavaScript APIs to the coding experience.":"PXT unterstützt ein modernes Verpackungssystem, mit dem Entwickler eigene Blöcke und JavaScript-APIs hinzu die Codierung Erfahrung kann.",
  "Powered by PXT":"Angetrieben von PXT",
  "Privacy & Cookies":"Datenschutz & Cookies",
  "Programming Experience Toolkit":"Programmierung-Erfahrung-Toolkit",
  "Programming Experience Toolkit Logo":"Programmierung-Erfahrung-Toolkit-Logo",
  "Report abuse":"Missbrauch melden",
  "Report sent":"Bericht gesendet",
  "Sample":"Probe",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Wählen Sie <b>Anonymous<\/b> und klicken Sie auf <b>Connect<\/b>.",
  "Show me the sample!":"Zeigen Sie mir die Probe!",
  "Sign in":"Anmelden",
  "Start coding":"Programmieren beginnen",
  "Stream: @name@":"Stream:-@name bei",
  "Stream: @name@ \/@id@":"Stream:-@name bei \/@id bei",
  "Streaming data in Excel 2016":"Streaming von Daten in Excel-2016",
  "Submit":"Senden",
  "Targets":"Ziele",
  "Terms Of Use":"Nutzungsbedingungen",
  "Thank you for helping keep PXT a friendly place!":"Danke für Ihre Hilfe, PXT einen freundlichen Ort zu halten!",
  "The":"Die",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"Die Microsoft Programmierung erleben Toolkit (PXT) bietet einen programmieren-Erfahrung rund um JavaScript (technisch, eine Teilmenge der",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Der Inhalt unten wird von einem PXT-Benutzer zur Verfügung gestellt und wird von Microsoft nicht unterstützt. Wenn Sie denken, ist es nicht angebracht, bitte",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"In diesem Stream gespeicherten Daten können leicht in ein Excel-2016 Tabellenkalkulation mit importiert werden",
  "Trademarks":"Marken",
  "TypeScript":"Typoskript",
  "URL":"URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Aktualisieren Sie auf JavaScript, Dank unserer rich-Text-Editor mit kontextbezogene Hilfe, Hintergrund-Kontrollen und Autovervollständigung.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Verwenden Sie PXT, um eine reibungslose Codierung Erfahrung für Ihr Projekt in Blöcke und JavaScript. Die APIs und die Common Language Runtime zu bauen und wir kümmern uns um die Editor-Sachen.",
  "User-provided content":"Benutzern bereitgestellte Inhalte",
  "Visual Studio Code":"Visual Studio Code",
  "We collect your GitHub user name and will display it together with your libraries.":"Wir erfassen Ihren Benutzernamen GitHub und zeigt sie zusammen mit Ihrer Bibliotheken.",
  "We'll use your GitHub user name":"Wir werden Ihr Benutzername GitHub verwenden.",
  "Why do you find it offensive?":"Warum findest du es beleidigend?",
  "You are now signed out from Programming Experience Toolkit":"Sie sind jetzt aus Erfahrung-Toolkit Programmierung abgemeldet",
  "You can go back to":"Sie können zurück zu gehen.",
  "You can still create scripts and":"Sie können noch Skripts erstellen und",
  "code the micro:bit":"das Mikro: Bit-Code",
  "contact us":"Kontaktieren Sie uns",
  "explore PXT":"erkunden Sie PXT",
  "https:\/\/az851932.vo.msecnd.net\/pub\/devefxkn\/microbit.simplified.svg":"https:\/\/az851932.vo.msecnd.NET\/Pub\/devefxkn\/microbit.Simplified.SVG",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/IMG.YouTube.com\/VI\/@args@\/hqdefault.jpg",
  "https:\/\/www.microbit.co.uk\/@ARGS@\/thumb":"https:\/\/www.microbit.co.uk\/@args@\/Thumb",
  "is a small wearable and programmable mbed-based device that visibly features a 5x5 LED display, accelerometer, compass, buttons, I\/O pins, Micro USB plug, Bluetooth Low Energy antenna, ARM Cortex-M0 processor, and battery plug. PXT will let you program it! PXT is compatible with the BBC micro:bit.":"ist ein kleine tragbare und programmierbare Mbed-basierten Gerät, das sichtlich verfügt über ein 5 x 5-LED-Display, Beschleunigungssensor, Kompass, Tasten, i\/o Pins, Micro-USB-Stecker, Bluetooth Low Energy-Antenne, Prozessor ARM Cortex-M0 und Batteriestecker. PXT lassen Sie ihn zu programmieren! PXT ist kompatibel mit dem BBC Micro: Bit.",
  "micro:bit":"Mikro: bisschen",
  "or":"oder",
  "pxt.io":"PXT.IO",
  "report abuse":"Missbrauch melden",
  "search docs...":"Suche Text &amp; Tabellen...",
  "sign in again":"erneut anmelden",
  "to save scripts to all your devices.":"Skripts auf all Ihren Geräten zu speichern.",
  "tutorial":"Lernprogramm",
  "view":"anzeigen",
  "© 2016 Microsoft":"2016 Microsoft ©"
}