{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# Öffne eine Shell und führe diese Befehle aus: pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title @ code.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). Die Lernkurve verläuft vom einfachen Block-basierten Editor über einen Text-Editor im Browser mit robusten Autovervollständigung und automatischer Korrektur, bis zu einer professionellen integrierten Entwicklungsumgebung (",
  ", or":", oder",
  "\/@id@":"\/@id@",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/Thumbnail\/1024\/Vimeo\/@args@",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>Du kannst deine regulären Skripts freigeben, ohne Dich vorher anzumelden.<\/b> Du musst dich nur anmelden, wenn Du Pakete (Bibliotheken) freigeben willst, die von anderen genutzt werden können. Dafür benötigst du einen GitHub-Account, der nur für Personen ab 13 Jahren und älter verfügbar ist.",
  "@name@ \/@id@":"@name@ \/@id@",
  "@title@ @byuser@":"@title@ @byuser@",
  "About":"Über",
  "About PXT":"Über PXT",
  "Block Editor":"Block-Editor",
  "Build your programming experience":"Erstelle dein Programmier-Erlebnis",
  "CSV":"CSV",
  "Cancel":"Abbrechen",
  "Click on <b>Close &amp; Load<\/b>.":"Klicke auf <b>Schließen &amp; Laden<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Klicke auf <b>Daten<\/b>» <b>Neue Anfrage<\/b>» <b>Aus anderen Quellen<\/b>» <b>Aus dem Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Kompatibel mit dem <b>BBC micro:bit<\/b>",
  "Contact Us":"Nimm Kontakt zu uns auf",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Steuere Deinen Kodu mit dem micro:bit! Du kannst die Bewegung von Zeichen mit Hilfe des Beschleunigungssensors steuern, per Knopfdruck springen und schießen, Animationen und durchlaufenden Text auf dem Bildschirm darstellen, über die IO-Pins mit anderen Geräten kommunizieren und vieles mehr..",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Erstelle eine <b>Leere Arbeitsmappe<\/b> in Excel 2016",
  "Do you need help installing the tools?":"Brauchst Du Hilfe bei der Installation der Werkzeuge?",
  "Download Kodu!":"Kodu herunterladen!",
  "Edit":"Bearbeiten",
  "Edit in":"Bearbeiten in",
  "Embed":"Einbinden",
  "Enter the following URL and click on <b>Connect<\/b>.":"Gebe die folgenden URL ein, und klicke auf <b>Verbinden<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Zusätzlicher Platz für Handlungsaufruf in der Fußzeile, der dabei helfen kann, Nutzer wieder zu aktivieren.",
  "Follow these instructions!":"Folge dieser Anleitung!",
  "Footer Header":"Fußzeile Kopfzeile",
  "Get & Transform":"Holen & Umwandeln",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Steige mit dem Anfänger-freundlichen Drag&amp;Drop-Code-Editor ein.",
  "GitHub":"GitHub",
  "Group 1":"Gruppe 1",
  "Group 2":"Gruppe 2",
  "Group 3":"Gruppe 3",
  "Houston, we have a problem.":"Houston, wir haben ein Problem.",
  "I Agree":"Ich stimme zu",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Ich bin einverstanden, dass mein GitHub Benutzername <b> @USERNAME@<\/b> zu jeder von mir veröffentlichten Bibliothek hinzugefügt wird",
  "I don't agree":"Ich stimme nicht zu",
  "JSON":"JSON",
  "JavaScript Editor":"JavaScript-Editor",
  "Kodu for micro:bit":"Kodu für micro:bit",
  "Learn more":"Weitere Informationen",
  "Link Four":"Link Vier",
  "Link One":"Link Eins",
  "Link Three":"Link Drei",
  "Link Two":"Link Zwei",
  "Live data powered by":"Echtzeitdaten mit Unterstützung von",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Stelle sicher, dass du dich bei Facebook, Office 365, Microsoft oder Google abmeldest, wenn du einen gemeinsam benutzten Computer nutzt.",
  "OK":"OK",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name@",
  "PXT - @title@":"PXT - @title@",
  "PXT - Sign in":"PXT - Anmelden",
  "PXT - Signed out":"PXT - Abgemeldet",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"PXT-Ziele, unter anderem für das BBC micro:bit, definieren eine Reihe von Blöcken und JavaScript-APIs, die für Benutzer bereitstehen. Lehrer und Entwickler können bestehende Ziele mit Publishing-Paketen oder Bibliotheken mit zusätzlichen Blöcken und APIs erweitern, sowie völlig neue Ziele bauen.",
  "Powered by PXT":"Unterstützt von PXT",
  "Privacy & Cookies":"Datenschutz & Cookies",
  "Programming Experience Toolkit":"Programmierung-Erfahrungs-Toolkit",
  "Programming Experience Toolkit Logo":"Programmierung-Erfahrungs-Toolkit-Logo",
  "Read the docs":"Lese die Dokumentation",
  "Report abuse":"Missbrauch melden",
  "Report sent":"Bericht gesendet",
  "Sample":"Beispiel",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Wähle <b>Anonym<\/b> und klicke auf <b>Verbinden<\/b>.",
  "Show me the sample!":"Zeige mir das Beispiel!",
  "Sign in":"Anmelden",
  "Start coding":"Programmierung starten",
  "Stream: @name@":"Stream: @name@",
  "Stream: @name@ \/@id@":"Stream: @name@ \/@id@",
  "Streaming data in Excel 2016":"Streame die Daten zu Excel 2016",
  "Submit":"Abschicken",
  "Targets":"Ziele",
  "Terms Of Use":"Nutzungsbedingungen",
  "Thank you for helping keep PXT a friendly place!":"Danke für deine Unterstützung dabei, PXT als freundlichen Ort zu bewahren!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"Das Microsoft Programmiererlebnis-Toolkit (PXT) bietet eine Programiererfahrung rund um JavaScript (technisch gesehen, eine Teilmenge der",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Der unten dargestellte Inhalte wurde von einem PXT-Nutzer bereitgestellt und wird nicht von Microsoft unterstützt. Wenn du denkst, dass er nicht angemessen ist, bitte",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"In diesem Stream gespeicherten Daten können leicht in ein Excel 2016 Tabellenkalkulationsdokument importiert werden mit",
  "Trademarks":"Warenzeichen",
  "TypeScript":"TypeScript",
  "URL":"URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Aktualisiere auf JavaScript durch unseren Rich-Text-Editor mit kontextbezogener Hilfe, Hintergrund-Überprüfung und Autovervollständigung.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Verwende PXT, um eine geschmeidige Programmiererfahrung für Dein Projekt zu erhalten, in Blocks und JavaScript. Erstelle die APIs und die Laufzeit und wir kümmern uns um den Editor-Kram.",
  "User-provided content":"Von Benutzern bereitgestellte Inhalte",
  "Visual Studio Code":"Visual Studio Code",
  "We collect your GitHub user name and will display it together with your libraries.":"Wir erfassen Deinen GitHub-Benutzernamen und zeigen diese zusammen mit Deinen Bibliotheken.",
  "We'll use your GitHub user name":"Wir werden deinen GitHub-Benutzernamen verwenden",
  "Why do you find it offensive?":"Warum findest du es beleidigend?",
  "You are now signed out from Programming Experience Toolkit":"Du hast dich von PXT abgemeldet",
  "You can go back to":"Du kannst zurückgehen zu",
  "You can still create scripts and":"Du kannst noch Skripte erstellen und",
  "code the micro:bit":"Programmiere das micro:bit",
  "contact us":"Kontaktiere uns",
  "explore PXT":"Erkunde PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg",
  "micro:bit":"micro:bit",
  "or":"oder",
  "pxt.io":"pxt.io",
  "report abuse":"Missbrauch melden",
  "search docs...":"Suche Dokumente...",
  "sign in again":"Erneut anmelden",
  "to save scripts to all your devices.":"um die Skripte auf all deinen Geräten zu speichern.",
  "tutorial":"Anleitung",
  "view":"anzeigen",
  "© 2016 Microsoft":"© 2016 Microsoft"
}