{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# Откройте оболочку и выполните эти команды pxt извлечь cd @title https:\/\/codethemicrobit.com\/@id@ @ код.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). Опыт имеет встроенный прогрессии от простой редактор, на основе блоков, через редактор текста в браузере с надежные авто завершения и авто исправление, вплоть до устоячивое (профессионального комплексного развития",
  ", or":", или",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/Thumbnail\/1024\/Vimeo\/@args @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You можете поделиться ваши регулярные скрипты без подписания in.<\/b>, вам нужно войти, если вы хотите опубликовать пакеты (библиотеки) для использования другими. Чтобы войти, вам понадобится учетная запись GitHub, который доступен только для лиц 13 лет и старше.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "About":"О",
  "About PXT":"О PXT",
  "Block Editor":"Редактор блоков",
  "Build your programming experience":"Построить ваш опыт программирования",
  "CSV":"CSV",
  "Cancel":"Отмена",
  "Click on <b>Close &amp; Load<\/b>.":"Нажмите на <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Нажмите на <b>Data<\/b>» <b>New Query<\/b>» <b>From другие Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Совместим с микро: bit<\/b> <b>BBC",
  "Contact Us":"Свяжитесь с нами",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Контроль ваш Kodu с микро: бит! Вы можете контролировать характер движения с помощью акселерометра, прыгать и стрелять нажатием, отображения анимации и прокрутка текста на экране, взаимодействие с другими устройствами через контакты IO и многое другое...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Создание <b>Blank Workbook<\/b> в Excel 2016",
  "Do you need help installing the tools?":"Вам нужна помощь при установке средства?",
  "Download Kodu!":"Скачайте Kodu!",
  "Edit":"Правка",
  "Edit in":"Редактирование в",
  "Embed":"Внедрить",
  "Enter the following URL and click on <b>Connect<\/b>.":"Введите следующий URL-адрес и нажмите на <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Дополнительное пространство для вызова действий внутри нижнего колонтитула, которые могли бы помочь вновь привлечь пользователей.",
  "Follow these instructions!":"Следуйте этим инструкциям!",
  "Footer Header":"Заголовок, нижний колонтитул",
  "Get & Transform":"Получить & преобразования",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Начать работу с редактором кода новичок дружественных drag&amp;drop.",
  "GitHub":"GitHub",
  "Group 1":"Группа 1",
  "Group 2":"Группа 2",
  "Group 3":"Группа 3",
  "Houston, we have a problem.":"Хьюстон, у нас есть проблема.",
  "I Agree":"Принимаю",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Я даю согласие на мой GitHub пользователя имя <b> @USERNAME@<\/b> сопровождающих любой библиотеки, которую я публикую",
  "I don't agree":"Я не согласен",
  "JSON":"JSON",
  "JavaScript Editor":"Редактор JavaScript",
  "Kodu for micro:bit":"Kodu для микро: бит",
  "Learn more":"Подробнее",
  "Link Four":"Ссылка 4",
  "Link One":"Ссылка одного",
  "Link Three":"Ссылка 3",
  "Link Two":"Ссылка 2",
  "Live data powered by":"Питание от данных",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Убедитесь, что вы выйдете из Facebook, Office 365, Microsoft или Google, если вы находитесь на общем компьютере.",
  "OK":"Хорошо",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - войти",
  "PXT - Signed out":"PXT - из аккаунта",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"PXT целей, в том числе один для BBC микро: бит, определяют набор блоков и JavaScript API доступны для пользователей. Преподавателей и разработчиков могут расширить существующие цели по публикации пакетов или библиотек с API и дополнительных блоков также создавать совершенно новые цели.",
  "Powered by PXT":"Руководствовался PXT",
  "Privacy & Cookies":"Конфиденциальности & Печенье",
  "Programming Experience Toolkit":"Инструментарий опыт программирования",
  "Programming Experience Toolkit Logo":"Логотип Инструментарий опыт программирования",
  "Read the docs":"Прочтите документы",
  "Report abuse":"Сообщить о нарушении",
  "Report sent":"Отчет отправлен",
  "Sample":"Пример",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Выберите <b>Anonymous<\/b> и нажмите <b>Connect<\/b>.",
  "Show me the sample!":"Покажите мне образец!",
  "Sign in":"Войти",
  "Start coding":"Начать кодирование",
  "Stream: @name@":"Поток: @name @",
  "Stream: @name@ \/@id@":"Поток: @name @ \/@id @",
  "Streaming data in Excel 2016":"Потоковая передача данных в Excel 2016",
  "Submit":"Отправить",
  "Targets":"Цели",
  "Terms Of Use":"Условия использования",
  "Thank you for helping keep PXT a friendly place!":"Благодарим вас за помощь держать PXT дружественное место!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"Microsoft программирования опыт инструментарий (PXT) обеспечивает опыт программирования, основанный вокруг JavaScript (технически, подмножество",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Ниже содержание обеспечивается PXT пользователя и не поддерживается корпорацией Майкрософт. Если вы думаете, это не уместно, пожалуйста",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Данные, хранящиеся в этом потоке может быть легко импортированы в электронную таблицу Excel 2016 с помощью",
  "Trademarks":"Товарные знаки",
  "TypeScript":"Машинопись",
  "URL":"URL-АДРЕС",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Обновление до JavaScript, благодаря нашей редактор форматированного текста с контекстной справки, проверок и авто завершение.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Используйте PXT для обеспечения гладкой опыт кодирования для вашего проекта, блокирует и JavaScript. Построить API и выполнения, и мы будет заботиться о вещи редактора.",
  "User-provided content":"Предоставляемый пользователем контент",
  "Visual Studio Code":"Visual Studio код",
  "We collect your GitHub user name and will display it together with your libraries.":"Мы собираем ваши имя пользователя GitHub и отобразит его вместе с вашей библиотеки.",
  "We'll use your GitHub user name":"Мы будем использовать ваше имя пользователя GitHub",
  "Why do you find it offensive?":"Почему вы считаете это оскорбительным?",
  "You are now signed out from Programming Experience Toolkit":"Теперь вы вошли от программирования Инструментарий опыт",
  "You can go back to":"Вы можете вернуться к",
  "You can still create scripts and":"Вы по-прежнему можно создавать сценарии и",
  "code the micro:bit":"код микро: бит",
  "contact us":"свяжитесь с нами",
  "explore PXT":"Исследуйте PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"HTTPS:\/\/img.YouTube.com\/VI\/@args@\/hqdefault.jpg",
  "micro:bit":"микро: бит",
  "or":"или",
  "pxt.io":"PXT.IO",
  "report abuse":"сообщить о нарушении",
  "search docs...":"Поиск документов...",
  "sign in again":"снова войдите в",
  "to save scripts to all your devices.":"чтобы сохранить скрипты на всех ваших устройствах.",
  "tutorial":"Учебник",
  "view":"вид",
  "© 2016 Microsoft":"© 2016 Microsoft"
}