{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# öppna ett skal och köra dessa kommandon pxt extrahera https:\/\/codethemicrobit.com\/@id@ cd @title @ kod.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). Erfarenheten har en inbyggd progression från enkel block-baserad editor, via i-beter text redaktör med robust bil-avslutningen och auto-fastställande, hela vägen till en professionell integrerad utveckling ingenjörsutbildningarna (",
  ", or":", eller",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/thumbnail\/1024\/Vimeo\/@ARGS @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You kan dela dina regelbundna skript utan att logga in.<\/b> behöver du bara logga in om du vill publicera paket (bibliotek) för att användas av andra. För att logga in behöver du en GitHub konto, som bara är tillgängligt för personer 13 och äldre.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "About":"Om",
  "About PXT":"Om PXT",
  "Block Editor":"Block Editor",
  "Build your programming experience":"Bygga din programmeringserfarenhet",
  "CSV":"CSV",
  "Cancel":"Avbryt",
  "Click on <b>Close &amp; Load<\/b>.":"Klicka på <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Klicka på <b>Data<\/b>» <b>New Query<\/b>» <b>From andra Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Kompatibel med <b>BBC micro: bit<\/b>",
  "Contact Us":"Kontakta oss",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Styra din Kodu med micro: lite! Du kan styra karaktär rörelse med hjälp av accelerometern, hoppa och skjuta med en knapptryckning, Visa animeringar och rullande text på skärmen, samverka med andra enheter genom IO pinnar, och mycket mer...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Skapa en <b>Blank Workbook<\/b> i Excel 2016",
  "Do you need help installing the tools?":"Behöver du hjälp med att installera verktygen?",
  "Download Kodu!":"Hämta Kodu!",
  "Edit":"Redigera",
  "Edit in":"Redigera i",
  "Embed":"Bädda in",
  "Enter the following URL and click on <b>Connect<\/b>.":"Ange följande URL och klicka på <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Extra utrymme för en uppmaning till handling inuti sidfoten som kunde bidra till att åter engagera användare.",
  "Follow these instructions!":"Följ dessa instruktioner!",
  "Footer Header":"Sidfot sidhuvud",
  "Get & Transform":"Get & transformering",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Komma igång med en nybörjare vänlig drag&amp;drop kod redaktör.",
  "GitHub":"GitHub",
  "Group 1":"Grupp 1",
  "Group 2":"Grupp 2",
  "Group 3":"Grupp 3",
  "Houston, we have a problem.":"Houston, vi har ett problem.",
  "I Agree":"Jag håller med",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Jag samtycker till min GitHub användare namn <b> @USERNAME@<\/b> medföljer alla bibliotek som jag publicerar",
  "I don't agree":"Jag håller inte",
  "JSON":"JSON",
  "JavaScript Editor":"JavaScript-redigerare",
  "Kodu for micro:bit":"Kodu för mikro: stycke",
  "Learn more":"Lära sig mer",
  "Link Four":"Länka fyra",
  "Link One":"Länka en",
  "Link Three":"Länka tre",
  "Link Two":"Länka två",
  "Live data powered by":"Live data drivs av",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Se till att du loggar ut från Facebook, Office 365, Microsoft eller Google om du är på en delad dator.",
  "OK":"Okej",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - logga in",
  "PXT - Signed out":"PXT - loggat ut",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"PXT mål, bland annat för BBC micro: lite, fastställa ett block och JavaScript APIs tillgängliga för användare. Lärare och utvecklare kan utöka befintliga mål av publishing paket eller bibliotek med ytterligare block och API: er samt bygga helt nya mål.",
  "Powered by PXT":"Powered by PXT",
  "Privacy & Cookies":"Privacy & Cookies",
  "Programming Experience Toolkit":"Programmering erfarenhet Toolkit",
  "Programming Experience Toolkit Logo":"Programmering erfarenhet Toolkit logotyp",
  "Read the docs":"Läs docs",
  "Report abuse":"Rapportera missbruk",
  "Report sent":"Rapporten skickas",
  "Sample":"Prov",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Välj <b>Anonymous<\/b> och klicka på <b>Connect<\/b>.",
  "Show me the sample!":"Visa mig provet!",
  "Sign in":"Logga in",
  "Start coding":"Starta kodning",
  "Stream: @name@":"Stream: @name @",
  "Stream: @name@ \/@id@":"Stream: @name @ \/@id @",
  "Streaming data in Excel 2016":"Strömmande data i Excel 2016",
  "Submit":"Lämna in",
  "Targets":"Mål",
  "Terms Of Use":"Villkor för användning",
  "Thank you for helping keep PXT a friendly place!":"Tack för att hjälpa hålla PXT ett vänligt ställe!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"Den Microsoft programmering Upplev Toolkit (PXT) tillhandahåller en programmering baserad runt JavaScript (tekniskt sett en delmängd av",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Innehållet nedan ges av en PXT användare och stöds inte av Microsoft. Om du tror att är det inte lämpligt, vänligen",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Data som lagras i denna ström kan enkelt importeras till ett Excel 2016 kalkylblad med",
  "Trademarks":"Varumärken",
  "TypeScript":"Skrivmaskin",
  "URL":"URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Uppgradera till JavaScript tack vare vår rik text redaktör med sammanhangsbaserad hjälp, bakgrundskontroller och automatisk komplettering.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Använda PXT för att ge en smidig kodning erfarenhet för ditt projekt, i block och JavaScript. Bygga de API: er och runtime och vi tar hand om redaktör grejer.",
  "User-provided content":"Användar-innehåll",
  "Visual Studio Code":"Visual Studio kod",
  "We collect your GitHub user name and will display it together with your libraries.":"Vi samlar in användarnamnet GitHub och visas tillsammans med dina bibliotek.",
  "We'll use your GitHub user name":"Vi använder användarnamnet GitHub",
  "Why do you find it offensive?":"Varför tycker du det kränkande?",
  "You are now signed out from Programming Experience Toolkit":"Du loggas nu ut från programmering erfarenhet Toolkit",
  "You can go back to":"Du kan gå tillbaka till",
  "You can still create scripts and":"Du kan fortfarande skapa skript och",
  "code the micro:bit":"koden micro: lite",
  "contact us":"Kontakta oss",
  "explore PXT":"utforska PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg",
  "micro:bit":"Micro: bit",
  "or":"eller",
  "pxt.io":"PXT.IO",
  "report abuse":"rapportera missbruk",
  "search docs...":"Sök docs...",
  "sign in again":"Logga in igen",
  "to save scripts to all your devices.":"att spara skript till alla dina enheter.",
  "tutorial":"handledning",
  "view":"Visa",
  "© 2016 Microsoft":"© 2016 Microsoft"
}