{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# Ανοίξτε ένα κέλυφος και να εκτελέσετε αυτές τις εντολές pxt εκχύλισμα https:\/\/codethemicrobit.com\/@id@ cd @title @ κώδικα.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). Η εμπειρία έχει μια ενσωματωμένη εξέλιξη από απλή μπλοκ-που βασίζεται επεξεργαστή, μέσα από πρόγραμμα επεξεργασίας κειμένου σε πρόγραμμα περιήγησης με ισχυρή αυτόματη συμπλήρωση και αυτόματη-στερέωση, όλος ο τρόπος σε μια επαγγελματική ολοκληρωμένης ανάπτυξης (environemnt",
  ", or":", ή",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/thumbnail\/1024\/Vimeo\/@ARGS @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You μπορούν να μοιραστούν τις δέσμες ενεργειών σας τακτική χωρίς υπογραφή in.<\/b> μόνο που χρειάζεται να εισέλθετε εάν επιθυμείτε να δημοσιεύσετε τα πακέτα (βιβλιοθήκες) να χρησιμοποιηθούν από άλλους χρήστες. Για να εισέλθετε, χρειάζεστε έναν λογαριασμό GitHub, το οποίο είναι διαθέσιμο μόνο για άτομα 13 και άνω.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "About":"Σχετικά με",
  "About PXT":"Σχετικά με PXT",
  "Block Editor":"Block Editor",
  "Build your programming experience":"Οικοδομήσουμε σας εμπειρία προγραμματισμού",
  "CSV":"CSV",
  "Cancel":"\"Άκυρο\"",
  "Click on <b>Close &amp; Load<\/b>.":"Κάντε κλικ στο <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Κάντε κλικ στο <b>Data<\/b>» <b>New Query<\/b>» <b>From άλλα Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Συμβατό με μικρο <b>BBC: bit<\/b>",
  "Contact Us":"Επικοινωνήστε μαζί μας",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Για να ελέγξετε σας Kodu με το μικρο: bit! Μπορείτε έλεγχος της κίνησης του χαρακτήρα χρησιμοποιώντας το επιταχυνσιόμετρο, άλμα και πυροβολούν με ένα πάτημα κουμπιού, εμφανίζει κινούμενες εικόνες και κύλιση κειμένου στην οθόνη, διασύνδεσης με άλλες συσκευές μέσω τις καρφίτσες IO, και πολλά άλλα...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Δημιουργήστε ένα Workbook<\/b> <b>Blank στο Excel 2016",
  "Do you need help installing the tools?":"Χρειάζεστε βοήθεια για την εγκατάσταση των εργαλείων;",
  "Download Kodu!":"Κατεβάζω Kodu!",
  "Edit":"Επεξεργασία",
  "Edit in":"Επεξεργασία σε",
  "Embed":"Ενσωματώσετε",
  "Enter the following URL and click on <b>Connect<\/b>.":"Εισάγετε την ακόλουθη διεύθυνση URL και κάντε κλικ στο <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Επιπλέον χώρο για μια πρόσκληση σε δράση μέσα στο υποσέλιδο που θα μπορούσε να βοηθήσει να συμμετάσχει εκ νέου τους χρήστες.",
  "Follow these instructions!":"Ακολουθήστε αυτές τις οδηγίες!",
  "Footer Header":"Υποσέλιδο κεφαλίδα",
  "Get & Transform":"Πάρτε & μετασχηματισμού",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Ξεκινήστε με ένα πρόγραμμα επεξεργασίας κώδικα του αρχάριος φιλικό drag&amp;drop.",
  "GitHub":"GitHub",
  "Group 1":"Ομάδα 1",
  "Group 2":"Ομάδα 2",
  "Group 3":"Ομάδα 3",
  "Houston, we have a problem.":"Χιούστον, έχουμε πρόβλημα.",
  "I Agree":"Συμφωνώ",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Συναινώ μου GitHub χρήστη όνομα <b> @USERNAME@<\/b> που συνοδεύουν κάθε βιβλιοθήκη δημοσιεύει",
  "I don't agree":"Δεν συμφωνώ",
  "JSON":"JSON",
  "JavaScript Editor":"Επεξεργαστής JavaScript",
  "Kodu for micro:bit":"Kodu για μικρο: bit",
  "Learn more":"Μάθε περισσότερα",
  "Link Four":"Συνδέσετε τέσσερις",
  "Link One":"Συνδέσετε ένα",
  "Link Three":"Συνδέσετε τρία",
  "Link Two":"Συνδέσετε δύο",
  "Live data powered by":"Τροφοδοτείται από τα ζωντανά στοιχεία",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Βεβαιωθείτε ότι μπορείτε να αποσυνδεθείτε από το Facebook, το Office 365, Microsoft ή Google, αν είστε σε έναν κοινόχρηστο υπολογιστή.",
  "OK":"Ok",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - είσοδος",
  "PXT - Signed out":"PXT - εκτός σύνδεσης",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"PXT στόχους, συμπεριλαμβανομένου ενός για το BBC μικρο: bit, καθορισμού μπλοκ και JavaScript API που είναι διαθέσιμες στους χρήστες. Οι εκπαιδευτικοί και οι προγραμματιστές μπορούν να επέκταση υφισταμένων στόχων από εκδοτικός πακέτα ή βιβλιοθήκες με πρόσθετες μπλοκ και APIs καθώς και οικοδομήσουμε εντελώς νέους στόχους.",
  "Powered by PXT":"Powered by PXT",
  "Privacy & Cookies":"Προστασία προσωπικών δεδομένων & Cookies",
  "Programming Experience Toolkit":"Κιτ εργαλείων εμπειρία προγραμματισμού",
  "Programming Experience Toolkit Logo":"Προγραμματισμός εμπειρία Toolkit λογότυπο",
  "Read the docs":"Διαβάστε το docs",
  "Report abuse":"Αναφορά κατάχρησης",
  "Report sent":"Έκθεση αποστολή",
  "Sample":"Δείγμα",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Επιλέξτε <b>Anonymous<\/b> και κάντε κλικ στο <b>Connect<\/b>.",
  "Show me the sample!":"Δείξε μου το δείγμα!",
  "Sign in":"Είσοδος",
  "Start coding":"Αρχίσει η κωδικοποίηση",
  "Stream: @name@":"Ρεύμα: @name @",
  "Stream: @name@ \/@id@":"Ρεύμα: @name @ \/@id @",
  "Streaming data in Excel 2016":"Ροή δεδομένων στο Excel 2016",
  "Submit":"Υποβάλουν",
  "Targets":"Στόχοι",
  "Terms Of Use":"Όροι χρήσης",
  "Thank you for helping keep PXT a friendly place!":"Σας ευχαριστώ για τη βοήθειά κρατήσει PXT ένα φιλικό μέρος!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"Η Microsoft προγραμματισμού εμπειρία Toolkit (PXT) παρέχει μια εμπειρία προγραμματισμού που βασίζονται γύρω από JavaScript (τεχνικά, ένα υποσύνολο του",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Το παρακάτω περιεχόμενο παρέχεται από το χρήστη PXT, και δεν έχει εγκριθεί από τη Microsoft. Αν νομίζετε ότι δεν είναι σκόπιμο, παρακαλώ",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Τα δεδομένα που αποθηκεύονται σε αυτό το ρεύμα μπορεί να εισαχθεί εύκολα σε ένα υπολογιστικό φύλλο χρησιμοποιώντας το Excel 2016",
  "Trademarks":"Εμπορικά σήματα",
  "TypeScript":"Γραφομηχανή",
  "URL":"ΔΙΕΎΘΥΝΣΗ URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Αναβάθμιση σε JavaScript, χάρη σε μας πλούσιο πρόγραμμα επεξεργασίας κειμένου με βάση τα συμφραζόμενα βοήθεια, ελέγχους ιστορικού και αυτόματη συμπλήρωση.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Μπορείτε να χρησιμοποιήσετε PXT για να παρέχει μια ομαλή εμπειρία κωδικοποίησης για το έργο σας σε μπλοκ και JavaScript. Φτιάξτε τα API και το χρόνο εκτέλεσης και θα φροντίσουμε από το υλικό του επεξεργαστή.",
  "User-provided content":"Χρήστη εφόσον περιεχόμενο",
  "Visual Studio Code":"Κώδικα Visual Studio",
  "We collect your GitHub user name and will display it together with your libraries.":"Συλλέγουμε το όνομα χρήστη σας GitHub και θα εμφανιστεί μαζί με τις βιβλιοθήκες.",
  "We'll use your GitHub user name":"Θα χρησιμοποιήσουμε το όνομα χρήστη σας GitHub",
  "Why do you find it offensive?":"Γιατί μπορείτε να το βρείτε προσβλητικό;",
  "You are now signed out from Programming Experience Toolkit":"Τώρα είστε συνδεδεμένοι από το κιτ εργαλείων προγραμματισμού εμπειρία",
  "You can go back to":"Μπορείτε να πάτε πίσω και να",
  "You can still create scripts and":"Μπορείτε να δημιουργήσετε δέσμες ενεργειών και",
  "code the micro:bit":"το μικρο: κομμάτι κώδικα",
  "contact us":"Επικοινωνήστε μαζί μας",
  "explore PXT":"Εξερευνήστε: PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.YouTube.com\/VI\/@ARGS@\/hqdefault.jpg",
  "micro:bit":"μικρο: bit",
  "or":"ή",
  "pxt.io":"pxt.io",
  "report abuse":"Αναφορά κατάχρησης",
  "search docs...":"Αναζήτηση docs...",
  "sign in again":"εισέλθετε ξανά",
  "to save scripts to all your devices.":"για να αποθηκεύσετε τις δέσμες ενεργειών σε όλες τις συσκευές σας.",
  "tutorial":"φροντιστήριο",
  "view":"θέα",
  "© 2016 Microsoft":"© 2016 Microsoft"
}