{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"Deschideţi o consolă şi executaţi aceste comenzi pxt extrage https:\/\/codethemicrobit.com\/@id@ cd @title @ codul #.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). Experienta are un built-in progresie la bazate pe bloc editor simplu, prin intermediul browser-ul text redactor cu auto-completare robust şi auto-fixare, pana la o dezvoltare profesională integrată mediului (",
  ", or":", sau",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/thumbnail\/1024\/Vimeo\/@args @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You pot partaja script-urile dumneavoastră regulate fără semnarea in.<\/b> trebuie doar să conectaţi-vă dacă doriţi să publicaţi pachete (biblioteci) pentru a fi utilizate de către alţii. Pentru a face sign in, veţi avea nevoie de un cont pe GitHub, care este disponibil numai pentru persoanele în vârstă şi 13.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "About":"Despre",
  "About PXT":"Despre PXT",
  "Block Editor":"Editor de bloc",
  "Build your programming experience":"Construi dumneavoastră experienţă de programare",
  "CSV":"CSV",
  "Cancel":"Revocare",
  "Click on <b>Close &amp; Load<\/b>.":"Faceţi clic pe Load<\/b> de &amp; <b>Close.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Faceţi clic pe <b>Data<\/b>» <b>New Query<\/b>» <b>From alte Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Compatibil cu <b>BBC micro: bit<\/b>",
  "Contact Us":"Contactati-ne",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Controlul dumneavoastră Kodu cu micro: pic! Puteţi controla caracterul mişcării folosind accelerometrul, sari şi trage cu o apăsare de buton, display animaţii şi defilarea textului pe ecran, interfata cu alte dispozitive prin pinii IO, şi mult mai mult...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Creaţi o Workbook<\/b> <b>Blank în Excel 2016",
  "Do you need help installing the tools?":"Ai nevoie de ajutor instalarea instrumentele?",
  "Download Kodu!":"Download Kodu!",
  "Edit":"Editare",
  "Edit in":"Editare în",
  "Embed":"Încorporaţi",
  "Enter the following URL and click on <b>Connect<\/b>.":"Introduceţi următoarele URL-ul şi faceţi clic pe <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Spaţiu suplimentar pentru un apel la acţiune în interiorul subsol care ar putea ajuta la re-angajeze utilizatori.",
  "Follow these instructions!":"Urmaţi aceste instrucţiuni!",
  "Footer Header":"Subsolul antet",
  "Get & Transform":"Ia & Transform",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Începeţi cu un editor de cod începător drag&amp;drop prietenos.",
  "GitHub":"GitHub",
  "Group 1":"Grupa 1",
  "Group 2":"Grupa 2",
  "Group 3":"Grupa 3",
  "Houston, we have a problem.":"Houston, avem o problemă.",
  "I Agree":"sunt de acord",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Eu de acord meu GitHub utilizator nume <b> @USERNAME@<\/b> orice bibliotecă am publica de însoţire",
  "I don't agree":"Nu sunt de acord",
  "JSON":"JSON",
  "JavaScript Editor":"JavaScript Editor",
  "Kodu for micro:bit":"Kodu micro: pic",
  "Learn more":"află mai multe",
  "Link Four":"Link-ul de patru",
  "Link One":"Link-ul de transfer",
  "Link Three":"Link-ul de trei",
  "Link Two":"Link-ul de două",
  "Live data powered by":"Vii de date de",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Asiguraţi-vă că vă conectaţi Facebook, Office 365, Microsoft sau Google, dacă sunteţi pe un computer partajat.",
  "OK":"ok",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - semn în",
  "PXT - Signed out":"PXT - deconectat",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"PXT obiective, inclusiv unul pentru micro BBC: pic, defini un set de blocuri şi JavaScript APIs disponibile pentru utilizatori. Profesori şi dezvoltatorii pot extinde obiective existente de publicare pachete sau biblioteci cu blocuri suplimentare şi API-uri precum şi construi complet noi obiective.",
  "Powered by PXT":"Powered by PXT",
  "Privacy & Cookies":"Confidenţialitate & Cookies",
  "Programming Experience Toolkit":"Toolkit de experienta de programare",
  "Programming Experience Toolkit Logo":"Programare experienţă Toolkit Logo",
  "Read the docs":"Citeste docs",
  "Report abuse":"Raporteaza abuz",
  "Report sent":"Raportul trimis",
  "Sample":"Proba",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Selectaţi <b>Anonymous<\/b> şi faceţi clic pe <b>Connect<\/b>.",
  "Show me the sample!":"Arată-mi proba!",
  "Sign in":"conectează-te",
  "Start coding":"Începe de codificare",
  "Stream: @name@":"Stream: @name @",
  "Stream: @name@ \/@id@":"Stream: @name @ \/@id @",
  "Streaming data in Excel 2016":"Streaming de date în Excel 2016",
  "Submit":"Să prezinte",
  "Targets":"Obiective",
  "Terms Of Use":"Termeni de utilizare",
  "Thank you for helping keep PXT a friendly place!":"Vă mulţumim pentru a ajuta să păstreze PXT un loc prietenos!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"Microsoft programare experienţă Toolkit (PXT) oferă o experienţă de programare bazate pe JavaScript (punct de vedere tehnic, un subset al",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Conţinut de mai jos este furnizat de către un utilizator PXT, şi nu este aprobat de către Microsoft. Dacă credeţi că nu este cazul, vă rugăm să",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Datele stocate în acest flux poate fi cu uşurinţă importate într-o foaie de calcul Excel 2016 folosind",
  "Trademarks":"Mărci comerciale",
  "TypeScript":"Mașina de scris",
  "URL":"URL-UL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Upgrade-ul la JavaScript datorită noastre editor de text îmbogăţit cu ajutor contextual, controale de fond şi auto-finalizare.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Utilizarea PXT pentru a oferi o experienta buna de codificare pentru proiectul dumneavoastră, în blocuri şi JavaScript. Construi API-uri şi de rulare și vom avea grijă de lucruri editor.",
  "User-provided content":"Furnizat de conţinut",
  "Visual Studio Code":"Codul Visual Studio",
  "We collect your GitHub user name and will display it together with your libraries.":"Am colecta numele de utilizator GitHub şi va afişa împreună cu bibliotecile.",
  "We'll use your GitHub user name":"Vom utiliza numele de utilizator GitHub",
  "Why do you find it offensive?":"De ce vi se pare jignitor?",
  "You are now signed out from Programming Experience Toolkit":"Vă sunt acum deconectat de programare experienţă Toolkit",
  "You can go back to":"Puteţi merge înapoi la",
  "You can still create scripts and":"Încă mai aveţi posibilitatea să creaţi script-uri şi",
  "code the micro:bit":"codul micro: biţi",
  "contact us":"Contactati-ne",
  "explore PXT":"explora PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/vi\/@args@\/hqdefault.jpg",
  "micro:bit":"micro: biţi",
  "or":"sau",
  "pxt.io":"PXT.io",
  "report abuse":"Raporteaza abuz",
  "search docs...":"Search docs...",
  "sign in again":"Conectaţi-vă din nou",
  "to save scripts to all your devices.":"pentru a salva script-uri pentru toate dispozitivele tale.",
  "tutorial":"Tutorial",
  "view":"Vezi",
  "© 2016 Microsoft":"© 2016 Microsoft"
}