{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"Nr otwarcia powłoki i biegaæ tych polecenia, pxt wyodrębnić https:\/\/codethemicrobit.com\/@id@ cd @title @ kodu.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). Doświadczenie ma wbudowany progresji od prosty edytor oparty na bloku, za pomocą edytora tekstu w przeglądarce z solidne auto uzupełnianie i auto mocowanie, aż do zintegrowanego rozwoju zawodowego (niecodzienne",
  ", or":", albo",
  "\/@id@":"\/@id Naciśnij aby zarezerwować",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/Thumbnail\/1024\/Vimeo\/@args Naciśnij aby zarezerwować",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You można podzielić się regularne skrypty bez podpisywania in.<\/b>, tylko trzeba się zalogować, jeżeli chcesz opublikować pakiety (bibliotek) do wykorzystania przez innych. Się zalogować, musisz GitHub konta, która jest dostępna tylko dla osób starszych i 13.",
  "@name@ \/@id@":"@name Naciśnij aby zarezerwować \/@id Naciśnij aby zarezerwować",
  "@title@ @byuser@":"@title @ @byuser Naciśnij aby zarezerwować",
  "About":"O nas",
  "About PXT":"O PXT",
  "Block Editor":"Edytor bloku",
  "Build your programming experience":"Budować swoje doświadczenie w programowaniu",
  "CSV":"CSV",
  "Cancel":"Anuluj",
  "Click on <b>Close &amp; Load<\/b>.":"Kliknij na <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Kliknij na <b>Data<\/b>» <b>New Query<\/b>» <b>From innych Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Kompatybilny z <b>BBC mikro: bit<\/b>",
  "Contact Us":"Kontakt z nami",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Kontrolować swoje Kodu z micro: bit! Można kontrolować ruch postaci za pomocą akcelerometru, skakać i strzelać z naciśnięciem przycisku, wyświetlać animacje i przewijanie tekstu na ekranie interfejsu z innych urządzeń poprzez piny IO i wiele więcej...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Utwórz <b>Blank Workbook<\/b> w programie Excel 2016",
  "Do you need help installing the tools?":"Potrzebujesz pomocy przy instalacji narzędzia?",
  "Download Kodu!":"Pobierz program Kodu!",
  "Edit":"Edycja",
  "Edit in":"Edytowanie w",
  "Embed":"Osadź",
  "Enter the following URL and click on <b>Connect<\/b>.":"Wpisz następujący adres URL i kliknij na <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Dodatkowe miejsce na wezwanie do działania wewnątrz stopki, który może pomóc ponownie zaangażować użytkowników.",
  "Follow these instructions!":"Wykonaj te instrukcje!",
  "Footer Header":"Stopki nagłówek",
  "Get & Transform":"Uzyskać transformacji idealna",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Rozpocząć pracę z edytorem kodu drag&amp;drop przyjazny dla początkujących.",
  "GitHub":"GitHub",
  "Group 1":"Grupa 1",
  "Group 2":"Grupa 2",
  "Group 3":"Grupa 3",
  "Houston, we have a problem.":"Houston, mamy problem.",
  "I Agree":"Zgadzam się",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Wyrażam zgodę na mój GitHub użytkownika nazwa <b> Naciśnij aby zarezerwować USERNAME@<\/b> towarzyszące każdej biblioteki, które publikuję",
  "I don't agree":"Nie zgadzam się",
  "JSON":"JSON",
  "JavaScript Editor":"Edytor JavaScript",
  "Kodu for micro:bit":"Kodu dla mikro: bit",
  "Learn more":"Dowiedz się więcej",
  "Link Four":"Link 4",
  "Link One":"Jeden link",
  "Link Three":"Połącz trzy",
  "Link Two":"Połączyć dwa",
  "Live data powered by":"Na żywo dane zasilany przez",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Upewnij się, że wylogować się z Facebook, usługi Office 365, Microsoft i Google, jeśli używasz komputera współdzielonego.",
  "OK":"Ok",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name Naciśnij aby zarezerwować",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - Zaloguj się",
  "PXT - Signed out":"PXT - wylogowany",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"PXT cele, w tym jeden dla BBC mikro: bit, zdefiniować zestaw bloków i API JavaScript, które są dostępne dla użytkowników. Nauczyciele i deweloperów można rozszerzyć istniejące cele publikowania pakietów lub bibliotek z API i dodatkowe bloki jak również zbudować zupełnie nowe cele.",
  "Powered by PXT":"Napędzane przez PXT",
  "Privacy & Cookies":"Polityka prywatności i ciasteczka",
  "Programming Experience Toolkit":"Narzędzia do Budowy Doświadczeń Programistycznych (PXT)",
  "Programming Experience Toolkit Logo":"Programowania doświadczenie Toolkit Logo",
  "Read the docs":"Przeczytaj dokumenty",
  "Report abuse":"Zgłoś nadużycie",
  "Report sent":"Sprawozdania przesyłane",
  "Sample":"Próbki",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Wybierz <b>Anonymous<\/b> i kliknij <b>Connect<\/b>.",
  "Show me the sample!":"Pokaż mi próbkę!",
  "Sign in":"Rejestrowanie",
  "Start coding":"Rozpocznij kodowanie",
  "Stream: @name@":"Strumień: @name Naciśnij aby zarezerwować",
  "Stream: @name@ \/@id@":"Strumień: @name Naciśnij aby zarezerwować \/@id Naciśnij aby zarezerwować",
  "Streaming data in Excel 2016":"Streaming danych w programie Excel 2016",
  "Submit":"Prześlij",
  "Targets":"Cele",
  "Terms Of Use":"Zasady korzystania z usługi",
  "Thank you for helping keep PXT a friendly place!":"Dziękuję za pomoc, zachować PXT to przyjazne miejsce!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"Microsoft programowanie doświadczenie Toolkit (PXT) zapewnia doświadczenie w programowaniu wokół JavaScript (technicznie, podzbiór",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Poniżej treść jest dostarczane przez użytkownika PXT i nie jest zatwierdzony przez firmę Microsoft. Jeśli uważasz, że to nie jest właściwe, proszę",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Dane przechowywane w tym strumieniu łatwo mogą być importowane do korzystania z arkusza kalkulacyjnego programu Excel 2016",
  "Trademarks":"Znaki towarowe",
  "TypeScript":"Język typeScript",
  "URL":"ADRES URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Uaktualnienie do JavaScript dzięki nasz edytor tekstu sformatowanego z pomocy kontekstowej, kontroli tożsamości i Autouzupełnianie.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"PXT umożliwia uzyskanie gładkiej doświadczenia kodowania dla projektu, w blokach i JavaScript. Budowanie interfejsów API środowiska wykonawczego i będziemy dbać rzeczy edytora.",
  "User-provided content":"Treści dostarczone przez użytkownika",
  "Visual Studio Code":"Kod programu Visual Studio",
  "We collect your GitHub user name and will display it together with your libraries.":"Zbierz nazwy użytkownika GitHub i wyświetli ją wraz z biblioteki.",
  "We'll use your GitHub user name":"Będziemy używać nazwy użytkownika GitHub",
  "Why do you find it offensive?":"Dlaczego uważasz że obraźliwe?",
  "You are now signed out from Programming Experience Toolkit":"Teraz zalogowano z programowania Experience Toolkit",
  "You can go back to":"Możesz wrócić do",
  "You can still create scripts and":"Nadal można tworzyć skrypty i",
  "code the micro:bit":"kod micro: bit",
  "contact us":"kontakt z nami",
  "explore PXT":"Poznaj PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/VI\/@args@\/hqdefault.jpg",
  "micro:bit":"mikro: bit",
  "or":"lub",
  "pxt.io":"PXT.IO",
  "report abuse":"Zgłoś nadużycie",
  "search docs...":"wyszukiwanie dokumentów...",
  "sign in again":"Zaloguj się ponownie",
  "to save scripts to all your devices.":"Aby zapisać skrypty do wszystkich urządzeń.",
  "tutorial":"poradnik",
  "view":"Widok",
  "© 2016 Microsoft":"© 2016 Microsoft"
}