{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# mở trình bao và chạy các lệnh pxt giải nén đĩa cd https:\/\/codethemicrobit.com\/@id@ @title @ mã.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). Những kinh nghiệm có một sự tiến triển được xây dựng trong từ đơn giản dựa trên khối biên tập viên, thông qua trong trình duyệt văn bản soạn thảo mạnh mẽ tự động hoàn thành, và sửa chữa tự động, tất cả các cách để một (environemnt) phát triển tích hợp chuyên nghiệp",
  ", or":", hoặc",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/Thumbnail\/1024\/Vimeo\/@args @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You có thể chia sẻ các kịch bản thông thường mà không cần đăng in.<\/b>, bạn chỉ cần đăng nhập nếu bạn muốn xuất bản các gói (thư viện) sẽ được sử dụng bởi những người khác. Để đăng nhập, bạn sẽ cần một tài khoản GitHub, là chỉ dành cho người lớn và 13.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "About":"Về",
  "About PXT":"Về PXT",
  "Block Editor":"Khối biên tập",
  "Build your programming experience":"Xây dựng của bạn kinh nghiệm lập trình",
  "CSV":"CSV",
  "Cancel":"Hủy bỏ",
  "Click on <b>Close &amp; Load<\/b>.":"Click vào <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Click vào <b>Data<\/b>» <b>New Query<\/b>» <b>From khác Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Tương thích với <b>BBC micro: bit<\/b>",
  "Contact Us":"Liên hệ với chúng tôi",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Kiểm soát của bạn MSR với micro: chút! Bạn có thể điều khiển nhân vật di chuyển bằng cách sử dụng các gia tốc, nhảy và bắn với một nút bấm, Hiển thị hình ảnh động và di chuyển văn bản trên màn hình, giao tiếp với các thiết bị khác thông qua các chân IO, và nhiều hơn nữa...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Tạo một Workbook<\/b> <b>Blank trong Excel 2016",
  "Do you need help installing the tools?":"Bạn có cần trợ giúp cài đặt các công cụ?",
  "Download Kodu!":"Tải về MSR!",
  "Edit":"Chỉnh sửa",
  "Edit in":"Chỉnh sửa trong",
  "Embed":"Nhúng",
  "Enter the following URL and click on <b>Connect<\/b>.":"Nhập URL sau đây và nhấp vào <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Thêm không gian cho một cuộc gọi đến hành động bên trong chân trang có thể giúp tái tham gia người sử dụng.",
  "Follow these instructions!":"Thực hiện theo các hướng dẫn!",
  "Footer Header":"Tiêu đề chân trang",
  "Get & Transform":"Get & Transform",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Bắt đầu với một trình soạn thảo mã mới bắt đầu học thân thiện drag&amp;drop.",
  "GitHub":"GitHub",
  "Group 1":"Nhóm 1",
  "Group 2":"Nhóm 2",
  "Group 3":"Nhóm 3",
  "Houston, we have a problem.":"Houston, chúng tôi có một vấn đề.",
  "I Agree":"Tôi đồng ý",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Tôi đồng ý với tôi GitHub người dùng tên <b> @USERNAME@<\/b> đi kèm với bất kỳ thư viện tôi xuất bản",
  "I don't agree":"Tôi không đồng ý",
  "JSON":"JSON",
  "JavaScript Editor":"JavaScript Editor",
  "Kodu for micro:bit":"MSR cho micro: chút",
  "Learn more":"Tìm hiểu thêm",
  "Link Four":"Liên kết 4",
  "Link One":"Liên kết một",
  "Link Three":"Liên kết 3",
  "Link Two":"Liên kết 2",
  "Live data powered by":"Dữ liệu sống được tài trợ bởi",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Hãy chắc chắn rằng bạn đăng xuất khỏi Facebook, Office 365, Microsoft hay Google nếu bạn đang trên một máy tính được chia sẻ.",
  "OK":"Ok",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - đăng nhập",
  "PXT - Signed out":"PXT - đăng xuất",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"PXT mục tiêu, bao gồm một cho BBC micro: chút, định nghĩa một tập các khối và hàm JavaScript có sẵn cho người dùng. Giáo viên và nhà phát triển có thể mở rộng hiện có mục tiêu bằng cách xuất bản gói hoặc thư viện với các khối và API cũng như xây dựng các mục tiêu hoàn toàn mới.",
  "Powered by PXT":"Được tài trợ bởi PXT",
  "Privacy & Cookies":"Bảo mật & cookie",
  "Programming Experience Toolkit":"Bộ công cụ kinh nghiệm lập trình",
  "Programming Experience Toolkit Logo":"Biểu tượng công cụ kinh nghiệm lập trình",
  "Read the docs":"Đọc các tài liệu",
  "Report abuse":"Báo cáo lạm dụng",
  "Report sent":"Báo cáo đã gửi",
  "Sample":"Mẫu",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Chọn <b>Anonymous<\/b> và nhấp vào <b>Connect<\/b>.",
  "Show me the sample!":"Chỉ cho tôi mẫu!",
  "Sign in":"Đăng nhập",
  "Start coding":"Bắt đầu mã hóa",
  "Stream: @name@":"Stream: @name @",
  "Stream: @name@ \/@id@":"Stream: @name @ \/@id @",
  "Streaming data in Excel 2016":"Luồng dữ liệu trong Excel 2016",
  "Submit":"Gửi",
  "Targets":"Mục tiêu",
  "Terms Of Use":"Điều khoản sử dụng",
  "Thank you for helping keep PXT a friendly place!":"Cảm ơn bạn đã giúp giữ PXT một nơi thân thiện!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"Việc Microsoft chương trình trải nghiệm Toolkit (PXT) cung cấp một kinh nghiệm lập trình dựa trên JavaScript (về mặt kỹ thuật, một tập hợp con của",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Nội dung dưới đây được cung cấp bởi một người dùng PXT, và không được xác nhận bởi Microsoft. Nếu bạn nghĩ rằng nó không phải là thích hợp, xin vui lòng",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Dữ liệu được lưu trữ trong dòng này có thể dễ dàng được nhập khẩu vào một bảng tính Excel 2016 sử dụng",
  "Trademarks":"Thương hiệu",
  "TypeScript":"Bản sao",
  "URL":"URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Nâng cấp để JavaScript nhờ chúng tôi soạn thảo văn bản phong phú với trợ giúp theo ngữ cảnh, kiểm tra nền và tự động hoàn thành.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Sử dụng PXT để cung cấp một kinh nghiệm mã mịn cho dự án của bạn, trong khối và JavaScript. Xây dựng các API và thời gian và chúng tôi sẽ chăm sóc của các công cụ biên tập viên.",
  "User-provided content":"Nội dung cung cấp cho người dùng",
  "Visual Studio Code":"Visual Studio mã",
  "We collect your GitHub user name and will display it together with your libraries.":"Chúng tôi thu thập các tên người dùng GitHub và sẽ hiển thị cùng với thư viện của bạn.",
  "We'll use your GitHub user name":"Chúng tôi sẽ sử dụng tên người dùng GitHub",
  "Why do you find it offensive?":"Tại sao bạn có thấy nó xúc phạm?",
  "You are now signed out from Programming Experience Toolkit":"Bạn bây giờ là đăng nhập từ bộ công cụ kinh nghiệm lập trình",
  "You can go back to":"Bạn có thể quay trở lại",
  "You can still create scripts and":"Bạn vẫn có thể tạo kịch bản và",
  "code the micro:bit":"Mã vi: bit",
  "contact us":"liên hệ với chúng tôi",
  "explore PXT":"khám phá PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.YouTube.com\/vi\/@args@\/hqdefault.jpg",
  "micro:bit":"Micro: bit",
  "or":"hoặc",
  "pxt.io":"pxt.io",
  "report abuse":"báo cáo lạm dụng",
  "search docs...":"Tìm kiếm tài liệu...",
  "sign in again":"đăng nhập lại",
  "to save scripts to all your devices.":"để tiết kiệm script để tất cả các thiết bị của bạn.",
  "tutorial":"hướng dẫn",
  "view":"Xem",
  "© 2016 Microsoft":"© 2016 Microsoft"
}