{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# Отвори шкољка и покренули ове команде пxт издвојите хттпс:\/\/цодетхемицробит.цом\/@ид@ цд@титле @ кода.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). Искуство има уграђену напредовање од једноставне засноване на блок уредник, кроз уређивач текста у прегледачу са робусно аутоматско довршавање и ауто-поправљам, све до (за професионални развој интегрисаног енвиронемнт)",
  ", or":", или",
  "\/@id@":"\/@ид @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/Тхумбнаил\/1024\/Вимео\/@АРГС @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>Yоу можете дијелити своје редовне скрипте без потписивања ин.<\/b> потребно је само да се пријавите ако желите да објавите пакети (библиотеке) да се користи од стране других. Да бисте се пријавили, морате ГитХуб рачуна, која је доступна само особама 13 и старији.",
  "@name@ \/@id@":"@наме @ \/@ид @",
  "@title@ @byuser@":"@титле @ @бyусер @",
  "About":"О",
  "About PXT":"О ПXТ",
  "Block Editor":"Блок Едитор",
  "Build your programming experience":"Гради твоје програмирање искуство",
  "CSV":"ЦСВ",
  "Cancel":"Отказивање",
  "Click on <b>Close &amp; Load<\/b>.":"Кликните на <b>Цлосе &amp; Лоад<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Кликните на <b>Дата<\/b>» <b>Неw Qуерy<\/b>» <b>Фром других Соурцес<\/b>» <b>Фром Wеб<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Компатибилан са <b>ББЦ микро: бит<\/b>",
  "Contact Us":"Контактирајте нас",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Контролисати своје Коду са микро: битни! Можете да контролишете знак покрета користећи се аццелерометер, скок и пуцати са притисни дугме, приказати анимације и померање текста на екрану интерфејса са другим уређајима кроз ИО иглице, и још много тога...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Креирање је <b>Бланк Wоркбоок<\/b> у Еxцел 2016",
  "Do you need help installing the tools?":"Треба ти помоћ при инсталацији алат?",
  "Download Kodu!":"Преузмите Коду!",
  "Edit":"Уреди",
  "Edit in":"Уреди у",
  "Embed":"Уграђивање",
  "Enter the following URL and click on <b>Connect<\/b>.":"Унесите следеће УРЛ и кликните на <b>Цоннецт<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Додатни простор за позив за акцију у подножју који би могао поново да се укључи кориснике.",
  "Follow these instructions!":"Пратите ове инструкције!",
  "Footer Header":"Подножје заглавља",
  "Get & Transform":"Узми & трансформација",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Први кораци са уређивач кода за почетнике пријатељски драг&amp;дроп.",
  "GitHub":"ГитХуб",
  "Group 1":"Група 1",
  "Group 2":"Група 2",
  "Group 3":"Група 3",
  "Houston, we have a problem.":"Хоустон , имамо проблем.",
  "I Agree":"слажем се",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Пристајем на мој ГитХуб корисничко име <b> ливебy УСЕРНАМЕ@<\/b> пратећих свим библиотекама да објавим",
  "I don't agree":"Не слажем се",
  "JSON":"ШТО СУ ЈСОН",
  "JavaScript Editor":"ЈаваСцрипт уређивач",
  "Kodu for micro:bit":"Коду за микро: битни",
  "Learn more":"учи више",
  "Link Four":"Повезивање 4",
  "Link One":"Повежите један",
  "Link Three":"Повезивање три",
  "Link Two":"Повезивање два",
  "Live data powered by":"Напаја података уживо",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Побрини се да те Одјави са Фацебоок, Оффице 365, Мицрософт или Гоогле, ако си на дијељеном рачуналу.",
  "OK":"у реду",
  "PXT":"ПXТ",
  "PXT - @name@":"ПXТ - @наме @",
  "PXT - @title@":"ПXТ - @титле @",
  "PXT - Sign in":"ПXТ - пријављивање",
  "PXT - Signed out":"ПXТ - пријављени",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"ПXТ циљева, укључујући и једну за ББЦ микро: битни, дефинисати скуп блокова и ЈаваСцрипт АПИ-ји доступни корисницима. Наставници и програмери могу проширивање постојећих циљева од стране издавачке пакете или библиотека са додатних блокова и АПИ-ја као и изградњу потпуно нове мете.",
  "Powered by PXT":"Поwеред бy ПXТ",
  "Privacy & Cookies":"Приватност и колачиће",
  "Programming Experience Toolkit":"Програмирање искуство за утврђивање",
  "Programming Experience Toolkit Logo":"Програмирање искуство за утврђивање Лого",
  "Read the docs":"Проиитај доктори",
  "Report abuse":"Пријава злоупотребе",
  "Report sent":"Извештај је послат",
  "Sample":"Узорак",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Изаберите <b>Анонyмоус<\/b> и кликните на <b>Цоннецт<\/b>.",
  "Show me the sample!":"Покажи ми узорак!",
  "Sign in":"упиши се",
  "Start coding":"Старт за кодирање",
  "Stream: @name@":"Проток : @наме @",
  "Stream: @name@ \/@id@":"Проток : @наме @ \/@ид @",
  "Streaming data in Excel 2016":"Проток података у Еxцел 2016",
  "Submit":"Проследите",
  "Targets":"Мете",
  "Terms Of Use":"Услови кориштења",
  "Thank you for helping keep PXT a friendly place!":"Хвала ти стално ПXТ пријатељско место!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"На Мицрософт програмирање искуство Тоолкит (ПXТ) пружа искуство за програмирање који се заснивају на ЈаваСцрипт (Технички, подскуп",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Испод садржаја обезбеђује ПXТ корисник, а не одобри Мицрософт. Ако мислите да није прикладно, молим те",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Податке ускладиштене у овај ток лако могу да се увезу у Еxцел 2016 унакрсне табеле помоћу",
  "Trademarks":"Заштитни знаци",
  "TypeScript":"ТyпеСцрипт",
  "URL":"УРЛ АДРЕСА",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Надоградите ЈаваСцрипт захваљујући нам уређивач обогаћеног текста са контекстуалне помоћи\",\" провером \"и\" Аутоматско довршавање.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Користите ПXТ да је глатко кодирања искуство за твој пројекат, у блоковима и ЈаваСцрипт. Гради на АПИ-ја и у извршавању и ми ће се побринути за уређивач робу.",
  "User-provided content":"Садржај који је обезбедила корисника",
  "Visual Studio Code":"Кôд Висуал Студио",
  "We collect your GitHub user name and will display it together with your libraries.":"Ми сакупљамо ГитХуб корисничко име и то ће приказати заједно са своје библиотеке.",
  "We'll use your GitHub user name":"Користимо ГитХуб корисничко име",
  "Why do you find it offensive?":"Зашто вам је било увредљиво?",
  "You are now signed out from Programming Experience Toolkit":"Сада пријављени сте из Программинг Тоолкит искуство",
  "You can go back to":"Можете се вратити",
  "You can still create scripts and":"И даље можете креирати скрипте и",
  "code the micro:bit":"Шифра је микро: бит",
  "contact us":"Контактирајте нас",
  "explore PXT":"Истражите ПXТ",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"хттпс:\/\/ИМГ.YоуТубе.цом\/ви\/@АРГС@\/хqдефаулт.јпг",
  "micro:bit":"микро : битни",
  "or":"или",
  "pxt.io":"pxt.io",
  "report abuse":"Пријава злоупотребе",
  "search docs...":"Претрага доктори...",
  "sign in again":"поново се пријавите у",
  "to save scripts to all your devices.":"да бисте сачували скрипте на свим уређајима.",
  "tutorial":"упутство за",
  "view":"Приказ",
  "© 2016 Microsoft":"© 2016 Мицрософт"
}