{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# abre una shell y ejecutar estos comandos pxt extracto https:\/\/codethemicrobit.com\/@id@ cd @title @ código.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). La experiencia tiene una progresión incorporada desde el simple editor basado en bloques, a través del editor de texto en el navegador con finalización automática robusta y fijación automática, hasta un (entornos de desarrollo profesional integrado",
  ", or":", o",
  "\/@id@":"\/@id a",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/thumbnail\/1024\/Vimeo\/@args a",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You puede compartir sus guiones regulares sin firmar in.<\/b> que sólo tiene que firmar si desea publicar paquetes (librerías) para ser utilizado por otros. Para iniciar sesión, usted necesitará una cuenta de GitHub, que sólo está disponible para personas mayores y 13.",
  "@name@ \/@id@":"@name a \/@id a",
  "@title@ @byuser@":"@title a @byuser a",
  "About":"Acerca de",
  "About PXT":"Acerca de PXT",
  "Block Editor":"Editor de bloques",
  "Build your programming experience":"Construir su experiencia en programación",
  "CSV":"CSV",
  "Cancel":"Cancelar",
  "Click on <b>Close &amp; Load<\/b>.":"Haga clic en <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Haga clic en <b>Data<\/b>» <b>New Query<\/b>» <b>From otra Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Compatible con <b>BBC micro: bit<\/b>",
  "Contact Us":"En contacto con nosotros",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Su Kodu con el micro: bit de control! Puede controlar el movimiento de caracteres utilizando el acelerómetro, saltar y disparar con una pulsación, Mostrar animaciones y desplazamiento de texto en la pantalla, interfaz con otros dispositivos a través de los pernos del IO y mucho más...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Crear un Workbook<\/b> de <b>Blank en Excel 2016",
  "Do you need help installing the tools?":"¿Necesita instalar las herramientas de ayuda?",
  "Download Kodu!":"Descargar Kodu!",
  "Edit":"Editar",
  "Edit in":"Editar en",
  "Embed":"Insertar",
  "Enter the following URL and click on <b>Connect<\/b>.":"Introduzca la siguiente URL y haga clic en <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Espacio adicional para una llamada a la acción en el pie de página que puede ayudar a volver a los usuarios.",
  "Follow these instructions!":"¡Siga estas instrucciones!",
  "Footer Header":"Encabezado de pie de página",
  "Get & Transform":"Obtener y transformar",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Comience con un editor de código para principiantes drag&amp;drop amistoso.",
  "GitHub":"GitHub",
  "Group 1":"Grupo 1",
  "Group 2":"Grupo 2",
  "Group 3":"Grupo 3",
  "Houston, we have a problem.":"Houston, tenemos un problema.",
  "I Agree":"De acuerdo",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Doy mi consentimiento a mi GitHub usuario nombre <b> en USERNAME@<\/b> que acompaña a cualquier biblioteca de que publico",
  "I don't agree":"No estoy de acuerdo",
  "JSON":"JSON",
  "JavaScript Editor":"Editor de JavaScript",
  "Kodu for micro:bit":"Kodu micro: poco",
  "Learn more":"Aprende más",
  "Link Four":"Enlace a cuatro",
  "Link One":"Enlace a una",
  "Link Three":"Enlace tres",
  "Link Two":"Vincular dos",
  "Live data powered by":"Datos en tiempo real desarrollados por",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Asegúrese de que iniciar sesión de Facebook, Office 365, Microsoft o Google si estás en un ordenador compartido.",
  "OK":"Vale",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name a",
  "PXT - @title@":"PXT - @title a",
  "PXT - Sign in":"PXT - signo en",
  "PXT - Signed out":"PXT - firmado",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"Objetivos de PXT, incluyendo uno para el BBC micro: bit, definen un conjunto de bloques y APIs de JavaScript disponibles a usuarios. Profesores y los desarrolladores pueden ampliar destinos existentes por editorial paquetes o librerías con bloques adicionales y APIs así como construir totalmente nuevos objetivos.",
  "Powered by PXT":"Powered by PXT",
  "Privacy & Cookies":"Privacidad y Cookies",
  "Programming Experience Toolkit":"Kit de herramientas de programación experiencia",
  "Programming Experience Toolkit Logo":"Logo de kit de herramientas de experiencia de programación",
  "Read the docs":"Leer los documentos",
  "Report abuse":"Informar uso indebido de",
  "Report sent":"Informe enviado",
  "Sample":"Muestra",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Seleccione <b>Anonymous<\/b> y haga clic en <b>Connect<\/b>.",
  "Show me the sample!":"¡ Muéstrame la muestra!",
  "Sign in":"Inicia sesión",
  "Start coding":"Empezar codificación",
  "Stream: @name@":"Corriente: @name a",
  "Stream: @name@ \/@id@":"Corriente: @name a \/@id a",
  "Streaming data in Excel 2016":"Transmisión de datos en Excel 2016",
  "Submit":"Enviar",
  "Targets":"Objetivos",
  "Terms Of Use":"Términos de uso",
  "Thank you for helping keep PXT a friendly place!":"Gracias por ayudar a mantener PXT un lugar acogedor!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"El Microsoft programación experiencia Toolkit (PXT) proporciona una experiencia de programación en JavaScript (técnicamente, un subconjunto de",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"El contenido siguiente es proporcionado por un usuario PXT y no está avalado por Microsoft. Si usted piensa que no es apropiado, por favor",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Los datos almacenados en esta corriente se pueden importar fácilmente en una hoja de cálculo de Excel 2016 utilizando",
  "Trademarks":"Marcas comerciales",
  "TypeScript":"Mecanografiado",
  "URL":"URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Actualizar a JavaScript gracias a nuestro editor de texto enriquecido con ayuda contextual, antecedentes y finalización automática.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Utilice PXT para proporcionar una suave experiencia de codificación para su proyecto, en bloques y JavaScript. Construir el APIs y el tiempo de ejecución y nosotros nos encargamos de lo de editor.",
  "User-provided content":"Contenido proporcionado por el usuario",
  "Visual Studio Code":"Código de Visual Studio",
  "We collect your GitHub user name and will display it together with your libraries.":"Recopilamos su nombre de usuario de GitHub y mostrará junto con las bibliotecas.",
  "We'll use your GitHub user name":"Vamos a utilizar su nombre de usuario de GitHub",
  "Why do you find it offensive?":"¿Por qué ¿parece ofensivo?",
  "You are now signed out from Programming Experience Toolkit":"Ahora está firmado de kit de herramientas de experiencia de programación",
  "You can go back to":"Usted puede volver a",
  "You can still create scripts and":"Todavía puede crear secuencias de comandos y",
  "code the micro:bit":"micro: bits de código",
  "contact us":"en contacto con nosotros",
  "explore PXT":"explorar PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/IMG.youtube.com\/vi\/@args@\/hqdefault.jpg",
  "micro:bit":"micro: poco",
  "or":"o",
  "pxt.io":"PXT.IO",
  "report abuse":"Informar uso indebido de",
  "search docs...":"búsqueda de documentos...",
  "sign in again":"firmar otra vez",
  "to save scripts to all your devices.":"guardar scripts en todos los dispositivos.",
  "tutorial":"Tutorial",
  "view":"Ver",
  "© 2016 Microsoft":"© 2016 Microsoft"
}