{
  ", or":", o",
  "\/@id@":"\/@id a",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/thumbnail\/1024\/Vimeo\/@args a",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You puede compartir sus guiones regulares sin firmar in.<\/b> que sólo tiene que firmar si desea publicar paquetes (librerías) para ser utilizado por otros. Para iniciar sesión, usted necesitará una cuenta de GitHub, que sólo está disponible para personas mayores y 13.",
  "@name@ \/@id@":"@name a \/@id a",
  "@title@ @byuser@":"@title a @byuser a",
  "A Kinder JavaScript Experience":"Una experiencia de JavaScript Kinder",
  "About":"Acerca de",
  "Blocks Editor":"Editor de bloques",
  "Blocks to JavaScript coding experience":"Bloques en JavaScript experiencia de codificación",
  "Build your own libraries":"Construir sus propias bibliotecas",
  "Build your own targets":"Construir sus propios objetivos",
  "CSV":"CSV",
  "Cancel":"Cancelar",
  "Click on <b>Close &amp; Load<\/b>.":"Haga clic en <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Haga clic en <b>Data<\/b>» <b>New Query<\/b>» <b>From otra Sources<\/b>» <b>From Web<\/b>.",
  "Contact Us":"En contacto con nosotros",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Crear un Workbook<\/b> de <b>Blank en Excel 2016",
  "Embed":"Insertar",
  "Enter the following URL and click on <b>Connect<\/b>.":"Introduzca la siguiente URL y haga clic en <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Espacio adicional para una llamada a la acción en el pie de página que puede ayudar a volver a los usuarios.",
  "Footer Header":"Encabezado de pie de página",
  "Fork":"Horquilla",
  "Get & Transform":"Obtener y transformar",
  "Get Started!":"¡ Comience!",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Comience con un editor de código para principiantes drag&amp;drop amistoso.",
  "GitHub":"GitHub",
  "Group 1":"Grupo 1",
  "Group 2":"Grupo 2",
  "Group 3":"Grupo 3",
  "Hint":"Sugerencia",
  "Houston, we have a problem.":"Houston, tenemos un problema.",
  "I Agree":"De acuerdo",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Doy mi consentimiento a mi GitHub usuario nombre <b> en USERNAME@<\/b> que acompaña a cualquier biblioteca de que publico",
  "I don't agree":"No estoy de acuerdo",
  "JSON":"JSON",
  "JavaScript Editor":"Editor de JavaScript",
  "Link Four":"Enlace a cuatro",
  "Link One":"Enlace a una",
  "Link Three":"Enlace tres",
  "Link Two":"Vincular dos",
  "Live data.":"Datos en vivo.",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Asegúrese de que iniciar sesión de Facebook, Office 365, Microsoft o Google si estás en un ordenador compartido.",
  "OK":"Vale",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name a",
  "PXT - @title@":"PXT - @title a",
  "PXT - Sign in":"PXT - signo en",
  "PXT - Signed out":"PXT - firmado",
  "PXT for micro:bit":"PXT micro: poco",
  "PXT supports a modern packaging system that allows developer to add their own blocks and JavaScript APIs to the coding experience.":"PXT es compatible con un sistema de embalaje moderno que permite a desarrolladores agregar sus propios bloques y APIs de JavaScript para la codificación de la experiencia.",
  "Powered by PXT":"Powered by PXT",
  "Privacy & Cookies":"Privacidad y Cookies",
  "Programming Experience Toolkit":"Kit de herramientas de programación experiencia",
  "Programming Experience Toolkit (PXT) provides an programming experience based around JavaScript (technically, a subset of TypeScript). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (Visual Studio Code).":"Programación experiencia Toolkit (PXT) proporciona una experiencia de programación en JavaScript (técnicamente, un subconjunto de mecanografiado). La experiencia tiene una progresión incorporada desde el simple editor basado en bloques, a través del editor de texto en el navegador con finalización automática robusta y fijación automática, hasta un entornos de desarrollo integrado profesional (código de Visual Studio).",
  "Programming Experience Toolkit Logo":"Logo de kit de herramientas de experiencia de programación",
  "Report abuse":"Informar uso indebido de",
  "Report sent":"Informe enviado",
  "Sample":"Muestra",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Seleccione <b>Anonymous<\/b> y haga clic en <b>Connect<\/b>.",
  "Show me a package!":"¡ Muéstrame un paquete!",
  "Show me the sample!":"¡ Muéstrame la muestra!",
  "Sign in":"Inicia sesión",
  "Start coding micro:bit":"Inicio micro: bits de codificación",
  "Stream: @name@":"Corriente: @name a",
  "Stream: @name@ \/@id@":"Corriente: @name a \/@id a",
  "Streaming data in Excel 2016":"Transmisión de datos en Excel 2016",
  "Submit":"Enviar",
  "Targets":"Objetivos",
  "Terms Of Use":"Términos de uso",
  "Thank you for helping keep PXT a friendly place!":"Gracias por ayudar a mantener PXT un lugar acogedor!",
  "The BBC micro:bit is a small wearable and programmable mbed-based device that visibly features a 5x5 LED display, accelerometer, compass, buttons, I\/O pins, Micro USB plug, Bluetooth Low Energy antenna, ARM Cortex-M0 processor, and battery plug. PXT will let you program it!":"BBC micro: es un pequeño portátil y programable mbed para dispositivo que visiblemente presenta una pantalla de LED de 5 x 5, acelerómetro, brújula, botones, pins de I\/O, conector Micro USB, antena Bluetooth Low Energy, procesador ARM Cortex-M0 y enchufe de la batería. PXT le permitirá programar!",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"El contenido siguiente es proporcionado por un usuario PXT y no está avalado por Microsoft. Si usted piensa que no es apropiado, por favor",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Los datos almacenados en esta corriente se pueden importar fácilmente en una hoja de cálculo de Excel 2016 utilizando",
  "Trademarks":"Marcas comerciales",
  "URL":"URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Actualizar a JavaScript gracias a nuestro editor de texto enriquecido con ayuda contextual, antecedentes y finalización automática.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and javascript. Build the APIs and the runtime and we will take care of the editor stuff.":"Utilice PXT para proporcionar una suave experiencia de codificación para su proyecto, en bloques y javascript. Construir el APIs y el tiempo de ejecución y nosotros nos encargamos de lo de editor.",
  "User-provided content":"Contenido proporcionado por el usuario",
  "We collect your GitHub user name and will display it together with your libraries.":"Recopilamos su nombre de usuario de GitHub y mostrará junto con las bibliotecas.",
  "We'll use your GitHub user name":"Vamos a utilizar su nombre de usuario de GitHub",
  "Why do you find it offensive?":"¿Por qué ¿parece ofensivo?",
  "You are now signed out from Programming Experience Toolkit":"Ahora está firmado de kit de herramientas de experiencia de programación",
  "You can go back to":"Usted puede volver a",
  "You can still create scripts and":"Todavía puede crear secuencias de comandos y",
  "contact us":"en contacto con nosotros",
  "explore PXT":"explorar PXT",
  "https:\/\/az851932.vo.msecnd.net\/pub\/vzprhahi\/microbit.red.svg":"https:\/\/az851932.vo.msecnd.net\/pub\/vzprhahi\/microbit.red.svg",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/IMG.youtube.com\/vi\/@args@\/hqdefault.jpg",
  "https:\/\/www.microbit.co.uk\/@ARGS@\/thumb":"https:\/\/www.microbit.co.uk\/@args@\/Thumb",
  "micro:bit":"micro: poco",
  "or":"o",
  "pxt.io":"PXT.IO",
  "report abuse":"Informar uso indebido de",
  "search docs...":"búsqueda de documentos...",
  "sign in again":"firmar otra vez",
  "to save scripts to all your devices.":"guardar scripts en todos los dispositivos.",
  "tutorial":"Tutorial",
  "view":"Ver",
  "© 2016 Microsoft":"© 2016 Microsoft"
}