{
  ", or":", eller",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/thumbnail\/1024\/Vimeo\/@args @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You kan dele dine regelmæssige scripts uden at logge in.<\/b> behøver du kun at logge på, hvis du ønsker at udgive pakker (biblioteker) der skal bruges af andre. For at logge på, skal du en GitHub konto, som er kun tilgængelig for personer 13 og ældre.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "A Kinder JavaScript Experience":"En venligere JavaScript oplevelse",
  "About":"Om",
  "Blocks Editor":"Blokke Editor",
  "Blocks to JavaScript coding experience":"Blokke til JavaScript kodning erfaring",
  "Build your own libraries":"Opbygge dine egne biblioteker",
  "Build your own targets":"Opbygge dine egne mål",
  "CSV":"CSV",
  "Cancel":"Annuller",
  "Click on <b>Close &amp; Load<\/b>.":"Klik på <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Klik på <b>Data<\/b>» <b>New Query<\/b>» <b>From andre Sources<\/b>» <b>From Web<\/b>.",
  "Contact Us":"Kontakt os",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Oprette en <b>Blank Workbook<\/b> i Excel 2016",
  "Embed":"Integrere",
  "Enter the following URL and click on <b>Connect<\/b>.":"Indtast følgende webadresse og klik på <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Ekstra plads til en opfordring til handling inde den sidefod, der kan hjælpe med at re-engagere brugerne.",
  "Footer Header":"Sidefod sidehoved",
  "Fork":"Gaffel",
  "Get & Transform":"Get & transformering",
  "Get Started!":"Komme i gang!",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Komme i gang med en nybegynder venligt drag&amp;drop Kodeeditor.",
  "GitHub":"GitHub",
  "Group 1":"Gruppe 1",
  "Group 2":"Gruppe 2",
  "Group 3":"Gruppe 3",
  "Hint":"Vink",
  "Houston, we have a problem.":"Houston, vi har et problem.",
  "I Agree":"Jeg er enig",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Jeg accepterer at mine GitHub bruger navn <b> @USERNAME@<\/b> ledsager ethvert bibliotek jeg offentliggøre",
  "I don't agree":"Jeg er ikke enig",
  "JSON":"JSON",
  "JavaScript Editor":"JavaScript Editor",
  "Link Four":"Forbinde fire",
  "Link One":"Sammenkæde en",
  "Link Three":"Link tre",
  "Link Two":"Link to",
  "Live data.":"Live data.",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Kontroller, at du logger ud af Facebook, Office 365, Microsoft eller Google, hvis du er på en delt computer.",
  "OK":"Ok",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - log ind",
  "PXT - Signed out":"PXT - underskrevet",
  "PXT for micro:bit":"PXT for micro: bit",
  "PXT supports a modern packaging system that allows developer to add their own blocks and JavaScript APIs to the coding experience.":"PXT understøtter en moderne emballagesystem, der gør det muligt for udviklere at tilføje deres egne blokke og JavaScript APIs hen til den kodning erfaring.",
  "Powered by PXT":"Drevet af PXT",
  "Privacy & Cookies":"Privacy & Cookies",
  "Programming Experience Toolkit":"Programmering erfaring Toolkit",
  "Programming Experience Toolkit (PXT) provides an programming experience based around JavaScript (technically, a subset of TypeScript). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (Visual Studio Code).":"Programmering opleve Toolkit (PXT) giver en programmerings erfaring baseret omkring JavaScript (teknisk set er en delmængde af skrivemaskine). Oplevelsen har en indbygget progression fra enkle blokbaserede editor, gennem i browser teksteditor med robust auto-fuldførelse og auto-fixing, hele vejen til en professionel integreret udvikling environemnt (Visual Studio kode).",
  "Programming Experience Toolkit Logo":"Programmering erfaring Toolkit Logo",
  "Report abuse":"Rapporter misbrug",
  "Report sent":"Rapporten sendes",
  "Sample":"Stikprøve",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Vælg <b>Anonymous<\/b> og klik på <b>Connect<\/b>.",
  "Show me a package!":"Vis mig en pakke!",
  "Show me the sample!":"Vis mig prøven!",
  "Sign in":"Log på",
  "Start coding micro:bit":"Start kodning micro: bit",
  "Stream: @name@":"Stream: @name @",
  "Stream: @name@ \/@id@":"Stream: @name @ \/@id @",
  "Streaming data in Excel 2016":"Streaming af data i Excel 2016",
  "Submit":"Indsende",
  "Targets":"Mål",
  "Terms Of Use":"Vilkår for anvendelse",
  "Thank you for helping keep PXT a friendly place!":"Tak for at hjælpe holde PXT et venligt sted!",
  "The BBC micro:bit is a small wearable and programmable mbed-based device that visibly features a 5x5 LED display, accelerometer, compass, buttons, I\/O pins, Micro USB plug, Bluetooth Low Energy antenna, ARM Cortex-M0 processor, and battery plug. PXT will let you program it!":"BBC micro: bit er en lille wearable og programmerbar mbed-baserede enhed at synligt funktioner en 5 x 5 LED display, accelerometer, kompas, knapper, I\/O stifter, Micro USB stik, Bluetooth lavenergi antenne, ARM Bark-M0 processor og batteri stik. PXT vil lade dig programmere det!",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Indhold nedenfor gives af en PXT bruger, og er ikke godkendt af Microsoft. Hvis du tror, er det ikke hensigtsmæssigt, venligst",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Dataene i denne stream kan let importeres til en Excel 2016 regneark ved hjælp af",
  "Trademarks":"Varemærker",
  "URL":"URL-ADRESSE",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Opgradere til JavaScript takket være vores RTF-editor med kontekstuel hjælp, baggrundstjek og auto-fuldførelse.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and javascript. Build the APIs and the runtime and we will take care of the editor stuff.":"Bruge PXT til en glat kodning erfaring for dit projekt, i blokke og javascript. Opbygge API'erne og runtime og vi vil tage sig af editor ting.",
  "User-provided content":"Brugerleveret indhold",
  "We collect your GitHub user name and will display it together with your libraries.":"Vi indsamler brugernavnet GitHub og vil vise det sammen med din biblioteker.",
  "We'll use your GitHub user name":"Vi vil bruge brugernavnet GitHub",
  "Why do you find it offensive?":"Hvorfor kan du finde det anstødeligt?",
  "You are now signed out from Programming Experience Toolkit":"Du er nu logget ud fra programmering erfaring Toolkit",
  "You can go back to":"Du kan gå tilbage til",
  "You can still create scripts and":"Du kan stadig oprette scripts og",
  "contact us":"Kontakt os",
  "explore PXT":"udforske PXT",
  "https:\/\/az851932.vo.msecnd.net\/pub\/vzprhahi\/microbit.red.svg":"https:\/\/az851932.VO.msecnd.net\/pub\/vzprhahi\/microbit.Red.SVG",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/vi\/@args@\/hqdefault.jpg",
  "https:\/\/www.microbit.co.uk\/@ARGS@\/thumb":"https:\/\/www.microbit.co.uk\/@args@\/thumb",
  "micro:bit":"mikro: bit",
  "or":"eller",
  "pxt.io":"PXT.io",
  "report abuse":"rapporter misbrug",
  "search docs...":"Søg docs...",
  "sign in again":"Log ind igen",
  "to save scripts to all your devices.":"gemme scripts til alle dine enheder.",
  "tutorial":"tutorial",
  "view":"Se",
  "© 2016 Microsoft":"© 2016 Microsoft"
}