{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# åben en shell og opstille disse befalinger pxt uddrag https:\/\/codethemicrobit.com\/@id@ cd @title @ kode.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). Oplevelsen har en indbygget progression fra enkle blokbaserede editor, gennem i browser teksteditor med robust auto-fuldførelse og auto-fixing, hele vejen til en professionel integreret udvikling environemnt (",
  ", or":", eller",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/thumbnail\/1024\/Vimeo\/@args @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You kan dele dine regelmæssige scripts uden at logge in.<\/b> behøver du kun at logge på, hvis du ønsker at udgive pakker (biblioteker) der skal bruges af andre. For at logge på, skal du en GitHub konto, som er kun tilgængelig for personer 13 og ældre.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "About":"Om",
  "About PXT":"Om PXT",
  "Block Editor":"Blok Editor",
  "Build your programming experience":"Opbygge din programmeringserfaring",
  "CSV":"CSV",
  "Cancel":"Annuller",
  "Click on <b>Close &amp; Load<\/b>.":"Klik på <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Klik på <b>Data<\/b>» <b>New Query<\/b>» <b>From andre Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Kompatibel med <b>BBC micro: bit<\/b>",
  "Contact Us":"Kontakt os",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Styre din Kodu med micro: bit! Du kan styre karakter bevægelse ved hjælp af accelerometer, hoppe og skyde med tryk på en knap, vise animationer og rulletekst på skærmbilledet interface med andre enheder via IO pins og meget mere...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Oprette en <b>Blank Workbook<\/b> i Excel 2016",
  "Do you need help installing the tools?":"Har du brug for hjælp til at installere værktøjerne?",
  "Download Kodu!":"Dataoverføre Kodu!",
  "Edit":"Rediger",
  "Edit in":"Redigere i",
  "Embed":"Integrere",
  "Enter the following URL and click on <b>Connect<\/b>.":"Indtast følgende webadresse og klik på <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Ekstra plads til en opfordring til handling inde den sidefod, der kan hjælpe med at re-engagere brugerne.",
  "Follow these instructions!":"Følg disse instruktioner!",
  "Footer Header":"Sidefod sidehoved",
  "Get & Transform":"Get & transformering",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Komme i gang med en nybegynder venligt drag&amp;drop Kodeeditor.",
  "GitHub":"GitHub",
  "Group 1":"Gruppe 1",
  "Group 2":"Gruppe 2",
  "Group 3":"Gruppe 3",
  "Houston, we have a problem.":"Houston, vi har et problem.",
  "I Agree":"Jeg er enig",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Jeg accepterer at mine GitHub bruger navn <b> @USERNAME@<\/b> ledsager ethvert bibliotek jeg offentliggøre",
  "I don't agree":"Jeg er ikke enig",
  "JSON":"JSON",
  "JavaScript Editor":"JavaScript Editor",
  "Kodu for micro:bit":"Kodu for micro: bit",
  "Learn more":"Lær mere",
  "Link Four":"Forbinde fire",
  "Link One":"Sammenkæde en",
  "Link Three":"Link tre",
  "Link Two":"Link to",
  "Live data powered by":"Live data drevet af",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Kontroller, at du logger ud af Facebook, Office 365, Microsoft eller Google, hvis du er på en delt computer.",
  "OK":"Ok",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - log ind",
  "PXT - Signed out":"PXT - underskrevet",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"PXT mål, herunder en for BBC micro: bit, definerer et sæt af blokke og JavaScript APIs tilgængelige til brugere. Undervisere og udviklere kan udvide eksisterende mål af udgivelse pakker eller biblioteker med yderligere blokke og API'er samt bygge helt nye mål.",
  "Powered by PXT":"Drevet af PXT",
  "Privacy & Cookies":"Privacy & Cookies",
  "Programming Experience Toolkit":"Programmering erfaring Toolkit",
  "Programming Experience Toolkit Logo":"Programmering erfaring Toolkit Logo",
  "Read the docs":"Læs docs",
  "Report abuse":"Rapporter misbrug",
  "Report sent":"Rapporten sendes",
  "Sample":"Stikprøve",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Vælg <b>Anonymous<\/b> og klik på <b>Connect<\/b>.",
  "Show me the sample!":"Vis mig prøven!",
  "Sign in":"Log på",
  "Start coding":"Start kodning",
  "Stream: @name@":"Stream: @name @",
  "Stream: @name@ \/@id@":"Stream: @name @ \/@id @",
  "Streaming data in Excel 2016":"Streaming af data i Excel 2016",
  "Submit":"Indsende",
  "Targets":"Mål",
  "Terms Of Use":"Vilkår for anvendelse",
  "Thank you for helping keep PXT a friendly place!":"Tak for at hjælpe holde PXT et venligt sted!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"Den Microsoft programmering opleve Toolkit (PXT) giver en programmerings erfaring baseret omkring JavaScript (teknisk set er en delmængde af",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Indhold nedenfor gives af en PXT bruger, og er ikke godkendt af Microsoft. Hvis du tror, er det ikke hensigtsmæssigt, venligst",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Dataene i denne stream kan let importeres til en Excel 2016 regneark ved hjælp af",
  "Trademarks":"Varemærker",
  "TypeScript":"Skrivemaskine",
  "URL":"URL-ADRESSE",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Opgradere til JavaScript takket være vores RTF-editor med kontekstuel hjælp, baggrundstjek og auto-fuldførelse.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Bruge PXT til en glat kodning erfaring for dit projekt, i blokke og JavaScript. Opbygge API'erne og runtime og vi vil tage sig af editor ting.",
  "User-provided content":"Brugerleveret indhold",
  "Visual Studio Code":"Visual Studio kode",
  "We collect your GitHub user name and will display it together with your libraries.":"Vi indsamler brugernavnet GitHub og vil vise det sammen med din biblioteker.",
  "We'll use your GitHub user name":"Vi vil bruge brugernavnet GitHub",
  "Why do you find it offensive?":"Hvorfor kan du finde det anstødeligt?",
  "You are now signed out from Programming Experience Toolkit":"Du er nu logget ud fra programmering erfaring Toolkit",
  "You can go back to":"Du kan gå tilbage til",
  "You can still create scripts and":"Du kan stadig oprette scripts og",
  "code the micro:bit":"kode micro: bit",
  "contact us":"Kontakt os",
  "explore PXT":"udforske PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/vi\/@args@\/hqdefault.jpg",
  "micro:bit":"mikro: bit",
  "or":"eller",
  "pxt.io":"PXT.io",
  "report abuse":"rapporter misbrug",
  "search docs...":"Søg docs...",
  "sign in again":"Log ind igen",
  "to save scripts to all your devices.":"gemme scripts til alle dine enheder.",
  "tutorial":"tutorial",
  "view":"Se",
  "© 2016 Microsoft":"© 2016 Microsoft"
}