{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# פתח פגז, להפעיל פקודות אלה pxt לחלץ cd https:\/\/codethemicrobit.com\/@id@ @title @ קוד.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). החוויה יש התקדמות מובנה מעורך פשוטה מבוסס בלוק, באמצעות עורך טקסט בדפדפן השלמה אוטומטית החזקה ותיקון אוטומטי-, כל הדרך עד (ולשלילת פיתוח מקצועי משולב",
  ", or":", או",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/thumbnail\/1024\/vimeo\/@ARGS @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You ניתן לשתף קבצי ה-script רגיל ללא חתימת in.<\/b> שאתה רק צריך להיכנס. אם אתה רוצה לפרסם חבילות (ספריות) כדי לשמש על ידי אחרים. כדי להיכנס, תצטרך חשבון GitHub, אשר זמין רק אנשים 13 ומעלה.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "About":"אודות",
  "About PXT":"אודות PXT",
  "Block Editor":"בלוק עורך",
  "Build your programming experience":"לבנות את חוויית התיכנות שלך",
  "CSV":"CSV",
  "Cancel":"ביטול",
  "Click on <b>Close &amp; Load<\/b>.":"לחץ על <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"לחץ על <b>Data<\/b>» <b>New Query<\/b>» <b>From אחרים Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"תואם <b>BBC מיקרו: bit<\/b>",
  "Contact Us":"צור קשר",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"הפיקוח שלך קוד עם ה-micro: bit! באפשרותך בקרת תנועה תו באמצעות תאוצה, לקפוץ, לירות עם לחיצה על לחצן, להציג הנפשות, גלילת טקסט על המסך, ממשק עם מכשירים אחרים באמצעות הפינים IO, ועוד הרבה יותר.",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"יצירת Workbook<\/b> <b>Blank ב- Excel 2016",
  "Do you need help installing the tools?":"אתה צריך עזרה בהתקנת הכלים?",
  "Download Kodu!":"להוריד את קוד!",
  "Edit":"עריכה",
  "Edit in":"ערוך",
  "Embed":"להטביע",
  "Enter the following URL and click on <b>Connect<\/b>.":"הזן את כתובת URL הבאות ולחץ על <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"שטח נוסף עבור קריאה לפעולה בתוך הכותרת התחתונה שיכול לעזור למשתמשים לתקוף שוב.",
  "Follow these instructions!":"עקוב אחר ההוראות הבאות!",
  "Footer Header":"כותרת תחתונה",
  "Get & Transform":"קבל & שינוי צורה",
  "Get started with a beginner friendly drag&amp;drop code editor.":"נתחיל עם עורך קוד למתחילים drag&amp;drop ידידותי.",
  "GitHub":"GitHub",
  "Group 1":"קבוצה 1",
  "Group 2":"קבוצה 2",
  "Group 3":"קבוצה 3",
  "Houston, we have a problem.":". יוסטון, יש לנו בעיה.",
  "I Agree":"אני מסכים",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"אני מביע את הסכמתך שלי GitHub משתמש בשם <b> @USERNAME@<\/b> המלווה כל ספריית שפרסום",
  "I don't agree":"אני לא מסכים",
  "JSON":"JSON",
  "JavaScript Editor":"עורך JavaScript",
  "Kodu for micro:bit":"קוד מיקרו: קצת",
  "Learn more":"למד עוד",
  "Link Four":"קישור 4",
  "Link One":"קישור אחד",
  "Link Three":"קישור שלוש",
  "Link Two":"קישור שני",
  "Live data powered by":"נתונים חיים מופעל על ידי",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"ודא כי אתה נכנס פייסבוק, Office 365, מיקרוסופט או גוגל אם אתה במחשב משותף.",
  "OK":"אוקיי",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - כניסה",
  "PXT - Signed out":"PXT - מנותק",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"מטרות PXT, כולל אחד עבור ה-BBC micro: הסיבית, להגדיר ערכה של בלוקים, JavaScript ממשקי Api הזמינים למשתמשים. מורים, מפתחים יכולים להרחיב את מטרות הקיימות על-ידי פרסום חבילות או ספריות עם בלוקים נוספים APIs וכן לבנות מטרות חדשות לחלוטין.",
  "Powered by PXT":"מופעל על ידי PXT",
  "Privacy & Cookies":"עוגיות & פרטיות",
  "Programming Experience Toolkit":"ערכת ניסיון תכנות",
  "Programming Experience Toolkit Logo":"לוגו ערכת ניסיון תכנות",
  "Read the docs":"לקרוא את הרופאים",
  "Report abuse":"דווח על התעללות",
  "Report sent":"הדו ח נשלח",
  "Sample":"מדגם",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"בחר <b>Anonymous<\/b> ' ולחץ על ' <b>Connect<\/b> '.",
  "Show me the sample!":"הראה לי את הדגימה!",
  "Sign in":"הירשם",
  "Start coding":"להתחיל קידוד",
  "Stream: @name@":"זרם: @name @",
  "Stream: @name@ \/@id@":"זרם: @name @ \/@id @",
  "Streaming data in Excel 2016":"הזרמת נתונים ב- Excel 2016",
  "Submit":"שלח",
  "Targets":"מטרות",
  "Terms Of Use":"תנאי שימוש",
  "Thank you for helping keep PXT a friendly place!":"תודה שאתה עוזר לשמור על PXT מקום ידידותי!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"Microsoft תכנות לחוות Toolkit (PXT) מספק חוויה תכנות מבוסס סביב JavaScript (טכנית, תת-קבוצה של",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"להלן התוכן מסופק על ידי משתמש PXT, היא לא אושרה על-ידי Microsoft. אם אתה חושב שזה לא מתאים, בבקשה",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"הנתונים המאוחסנים זרם זה בקלות ניתן לייבא לתוך באמצעות גיליון אלקטרוני Excel 2016",
  "Trademarks":"סימני מסחר",
  "TypeScript":"הופנטתי",
  "URL":"כתובת URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"לשדרג ל- JavaScript בזכות שלנו עורך טקסט עשיר עם עזרה הקשרית, בדיקות רקע, השלמה אוטומטית.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"השתמש PXT כדי לספק חוויה חלקה קידוד עבור הפרוייקט שלך, ב בלוקים ו- JavaScript. לבנות ממשקי תיכנות היישומים של הריצה, ואנחנו נדאג של החומר עורך.",
  "User-provided content":"תוכן שסופק על-ידי המשתמש",
  "Visual Studio Code":"קוד visual Studio",
  "We collect your GitHub user name and will display it together with your libraries.":"אנו אוספים את שם המשתמש שלך GitHub, יציג אותו יחד עם הספריות שלך.",
  "We'll use your GitHub user name":"נשתמש שם המשתמש שלך GitHub",
  "Why do you find it offensive?":"למה אתה חושב שזה מעליב?",
  "You are now signed out from Programming Experience Toolkit":"עכשיו למערכת מתוך ערכת ניסיון תכנות",
  "You can go back to":"אתה יכול לחזור",
  "You can still create scripts and":"אתה עדיין יכול ליצור סקריפטים ו",
  "code the micro:bit":"קוד ה-micro: bit",
  "contact us":"צור קשר",
  "explore PXT":"לחקור את PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg",
  "micro:bit":"מיקרו: קצת",
  "or":"או",
  "pxt.io":"pxt.io",
  "report abuse":"דווח על התעללות",
  "search docs...":"חפש את הרופאים...",
  "sign in again":"להיכנס שוב",
  "to save scripts to all your devices.":"לשמירת קבצי script כל ההתקנים שלך.",
  "tutorial":"ערכת לימוד",
  "view":"תצוגה",
  "© 2016 Microsoft":"© 2016 Microsoft"
}