{
  ", or":", eller",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/Thumbnail\/1024\/Vimeo\/@ARGS @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You kan dele vanlige skriptene uten å logge in.<\/b> trenger du bare logge på hvis du ønsker å publisere pakker (biblioteker) som skal brukes av andre. For å logge på, må en GitHub konto, som er kun tilgjengelig for personer 13 år og eldre.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "A Kinder JavaScript Experience":"En snillere JavaScript-opplevelse",
  "About":"Om",
  "Blocks Editor":"Blokker redigering",
  "Blocks to JavaScript coding experience":"Blokker til JavaScript koding erfaring",
  "Build your own libraries":"Bygge din egen biblioteker",
  "Build your own targets":"Bygge din egen mål",
  "CSV":"CSV",
  "Cancel":"Avbryt",
  "Click on <b>Close &amp; Load<\/b>.":"Klikk på <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Klikk på <b>Data<\/b>» <b>New Query<\/b>» <b>From andre Sources<\/b>» <b>From Web<\/b>.",
  "Contact Us":"Kontakt oss",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Opprette en <b>Blank Workbook<\/b> i Excel 2016",
  "Embed":"Bygge inn",
  "Enter the following URL and click on <b>Connect<\/b>.":"Oppgi følgende Webadresse og klikk på <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Ekstra plass for en oppfordring til handling i bunnteksten som kan hjelpe å engasjere brukere.",
  "Footer Header":"Bunntekst topptekst",
  "Fork":"Gaffel",
  "Get & Transform":"Få & transformering",
  "Get Started!":"Komme i gang!",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Komme i gang med nybegynner vennlig drag&amp;drop koden editor.",
  "GitHub":"GitHub",
  "Group 1":"Gruppe 1",
  "Group 2":"Gruppe 2",
  "Group 3":"Gruppe 3",
  "Hint":"Hint",
  "Houston, we have a problem.":"Houston, har vi et problem.",
  "I Agree":"enig",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Jeg samtykke til mine GitHub bruker navnet <b> @USERNAME@<\/b> følger alle bibliotek jeg publisere",
  "I don't agree":"Jeg er ikke enig",
  "JSON":"JSON",
  "JavaScript Editor":"JavaScript-redigering",
  "Link Four":"Koble fire",
  "Link One":"Koble en",
  "Link Three":"Koble tre",
  "Link Two":"Koble to",
  "Live data.":"Direkte data.",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Kontroller at du logger deg av Facebook, Office 365, Microsoft eller Google hvis du er på en delt datamaskin.",
  "OK":"ok",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - Logg",
  "PXT - Signed out":"PXT - logget av",
  "PXT for micro:bit":"PXT mikro: bit",
  "PXT supports a modern packaging system that allows developer to add their own blocks and JavaScript APIs to the coding experience.":"PXT støtter et moderne innpakning system som lar utviklere å legge til sine egne blokker og JavaScript APIs koding erfaring.",
  "Powered by PXT":"Drevet av PXT",
  "Privacy & Cookies":"Personvern & informasjonskapsler",
  "Programming Experience Toolkit":"Programmering erfaring Toolkit",
  "Programming Experience Toolkit (PXT) provides an programming experience based around JavaScript (technically, a subset of TypeScript). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (Visual Studio Code).":"Programmering oppleve Toolkit (PXT) gir en programmeringserfaring basert rundt JavaScript (teknisk, et delsett av TypeScript). Erfaring har en innebygd progresjon fra enkel blokk-basert editor, gjennom i nettleseren tekstredigeringsprogram med robust autofullføring og auto-innfesting, helt til en profesjonell integrert utvikling environemnt (Visual Studio Code).",
  "Programming Experience Toolkit Logo":"Programmering erfaring Toolkit Logo",
  "Report abuse":"Rapporter misbruk",
  "Report sent":"Rapporten sendes",
  "Sample":"Eksempel",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Velg <b>Anonymous<\/b> og klikk <b>Connect<\/b>.",
  "Show me a package!":"Vis meg en pakke!",
  "Show me the sample!":"Vis meg prøven!",
  "Sign in":"logg inn",
  "Start coding micro:bit":"Start koding mikro: bit",
  "Stream: @name@":"Stream: @name @",
  "Stream: @name@ \/@id@":"Stream: @name @ \/@id @",
  "Streaming data in Excel 2016":"Streaming data i Excel 2016",
  "Submit":"Sende",
  "Targets":"Mål",
  "Terms Of Use":"Vilkår for bruk",
  "Thank you for helping keep PXT a friendly place!":"Takk for å holde PXT et vennlig sted!",
  "The BBC micro:bit is a small wearable and programmable mbed-based device that visibly features a 5x5 LED display, accelerometer, compass, buttons, I\/O pins, Micro USB plug, Bluetooth Low Energy antenna, ARM Cortex-M0 processor, and battery plug. PXT will let you program it!":"BBC micro: litt er en liten bærbar og programmerbare mbed-basert enhet som tydelig har en 5 x 5 LED-skjermen, akselerometer, kompass, knapper, I\/O pins, Micro USB-pluggen, Bluetooth lav energi antenne, ARM bark-M0 prosessor og batteri plug. PXT kan du programmere den!",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Innholdet nedenfor gis av en PXT bruker, og er ikke godkjent av Microsoft. Hvis du tror det ikke er aktuelt, vennligst",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Dataene i denne dataflyten kan lett importeres til et Excel-2016-regneark ved hjelp av",
  "Trademarks":"Varemerker",
  "URL":"URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Oppgradere til JavaScript takket være våre rik teksteditor med konteksthjelp, bakgrunnssjekker og autofullføring.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and javascript. Build the APIs and the runtime and we will take care of the editor stuff.":"Bruk PXT til å gi en jevn koding erfaring for prosjektet, i blokker og javascript. Bygge APIene og runtime og vi vil ta seg av redaktør ting.",
  "User-provided content":"Brukeren for innhold",
  "We collect your GitHub user name and will display it together with your libraries.":"Vi samler GitHub brukernavnet ditt og vil vises sammen med bibliotekene.",
  "We'll use your GitHub user name":"Vi vil bruke brukernavnet GitHub",
  "Why do you find it offensive?":"Hvorfor finner du det støtende?",
  "You are now signed out from Programming Experience Toolkit":"Du har nå logget ut fra programmering erfaring Toolkit",
  "You can go back to":"Du kan gå tilbake til",
  "You can still create scripts and":"Du kan fremdeles opprette skript og",
  "contact us":"Kontakt oss",
  "explore PXT":"Utforsk PXT",
  "https:\/\/az851932.vo.msecnd.net\/pub\/vzprhahi\/microbit.red.svg":"https:\/\/az851932.VO.msecnd.net\/pub\/vzprhahi\/microbit.Red.SVG",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg",
  "https:\/\/www.microbit.co.uk\/@ARGS@\/thumb":"https:\/\/www.microbit.co.uk\/@ARGS@\/thumb",
  "micro:bit":"Micro: bit",
  "or":"eller",
  "pxt.io":"pxt.io",
  "report abuse":"Rapporter misbruk",
  "search docs...":"Søk dokumenter...",
  "sign in again":"logge på igjen",
  "to save scripts to all your devices.":"Lagre skript alle enhetene.",
  "tutorial":"opplæringen",
  "view":"Vis",
  "© 2016 Microsoft":"© 2016 Microsoft"
}