{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# Åpne et skall og kjøre disse kommandoene pxt pakke https:\/\/codethemicrobit.com\/@id@ cd @title @ koden.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). Erfaring har en innebygd progresjon fra enkel blokk-basert editor, gjennom i nettleseren tekstredigeringsprogram med robust autofullføring og auto-innfesting, helt til en profesjonell integrert utvikling environemnt (",
  ", or":", eller",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/Thumbnail\/1024\/Vimeo\/@ARGS @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You kan dele vanlige skriptene uten å logge in.<\/b> trenger du bare logge på hvis du ønsker å publisere pakker (biblioteker) som skal brukes av andre. For å logge på, må en GitHub konto, som er kun tilgjengelig for personer 13 år og eldre.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "About":"Om",
  "About PXT":"Om PXT",
  "Block Editor":"Blokk Editor",
  "Build your programming experience":"Bygge din erfaring med programmering",
  "CSV":"CSV",
  "Cancel":"Avbryt",
  "Click on <b>Close &amp; Load<\/b>.":"Klikk på <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Klikk på <b>Data<\/b>» <b>New Query<\/b>» <b>From andre Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Kompatibel med <b>BBC micro: bit<\/b>",
  "Contact Us":"Kontakt oss",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Kontrollere din Kodu med micro: bit! Du kan kontrollere karakter bevegelse ved hjelp akselerasjonsmåleren, hoppe og skyte med et knappetrykk, vise animasjoner og rullende tekst på skjermen, grensesnitt med andre enheter gjennom IO pinnene og mye mer.",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Opprette en <b>Blank Workbook<\/b> i Excel 2016",
  "Do you need help installing the tools?":"Trenger du hjelp til å installere verktøyene?",
  "Download Kodu!":"Dataoverføre Kodu!",
  "Edit":"Rediger",
  "Edit in":"Redigere i",
  "Embed":"Bygge inn",
  "Enter the following URL and click on <b>Connect<\/b>.":"Oppgi følgende Webadresse og klikk på <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Ekstra plass for en oppfordring til handling i bunnteksten som kan hjelpe å engasjere brukere.",
  "Follow these instructions!":"Følg bruksanvisningen!",
  "Footer Header":"Bunntekst topptekst",
  "Get & Transform":"Få & transformering",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Komme i gang med nybegynner vennlig drag&amp;drop koden editor.",
  "GitHub":"GitHub",
  "Group 1":"Gruppe 1",
  "Group 2":"Gruppe 2",
  "Group 3":"Gruppe 3",
  "Houston, we have a problem.":"Houston, har vi et problem.",
  "I Agree":"enig",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Jeg samtykke til mine GitHub bruker navnet <b> @USERNAME@<\/b> følger alle bibliotek jeg publisere",
  "I don't agree":"Jeg er ikke enig",
  "JSON":"JSON",
  "JavaScript Editor":"JavaScript-redigering",
  "Kodu for micro:bit":"Kodu mikro: bit",
  "Learn more":"få mer informasjon",
  "Link Four":"Koble fire",
  "Link One":"Koble en",
  "Link Three":"Koble tre",
  "Link Two":"Koble to",
  "Live data powered by":"Aktive data drevet av",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Kontroller at du logger deg av Facebook, Office 365, Microsoft eller Google hvis du er på en delt datamaskin.",
  "OK":"ok",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - Logg",
  "PXT - Signed out":"PXT - logget av",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"PXT mål, inkludert en for BBC micro: litt, definerer et sett av blokker og JavaScript APIs tilgjengelig for brukere. Lærere og utviklere kan utvide eksisterende mål ved publisering pakker eller biblioteker med flere blokker og APIer som bygge helt nytt mål.",
  "Powered by PXT":"Drevet av PXT",
  "Privacy & Cookies":"Personvern & informasjonskapsler",
  "Programming Experience Toolkit":"Programmering erfaring Toolkit",
  "Programming Experience Toolkit Logo":"Programmering erfaring Toolkit Logo",
  "Read the docs":"Lese dokumenter",
  "Report abuse":"Rapporter misbruk",
  "Report sent":"Rapporten sendes",
  "Sample":"Eksempel",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Velg <b>Anonymous<\/b> og klikk <b>Connect<\/b>.",
  "Show me the sample!":"Vis meg prøven!",
  "Sign in":"logg inn",
  "Start coding":"Start koding",
  "Stream: @name@":"Stream: @name @",
  "Stream: @name@ \/@id@":"Stream: @name @ \/@id @",
  "Streaming data in Excel 2016":"Streaming data i Excel 2016",
  "Submit":"Sende",
  "Targets":"Mål",
  "Terms Of Use":"Vilkår for bruk",
  "Thank you for helping keep PXT a friendly place!":"Takk for å holde PXT et vennlig sted!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"Microsoft programmering oppleve Toolkit (PXT) gir en programmeringserfaring basert rundt JavaScript (teknisk, et delsett av",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Innholdet nedenfor gis av en PXT bruker, og er ikke godkjent av Microsoft. Hvis du tror det ikke er aktuelt, vennligst",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Dataene i denne dataflyten kan lett importeres til et Excel-2016-regneark ved hjelp av",
  "Trademarks":"Varemerker",
  "TypeScript":"TypeScript",
  "URL":"URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Oppgradere til JavaScript takket være våre rik teksteditor med konteksthjelp, bakgrunnssjekker og autofullføring.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Bruk PXT til å gi en jevn koding erfaring for prosjektet, i blokker og JavaScript. Bygge APIene og runtime og vi vil ta seg av redaktør ting.",
  "User-provided content":"Brukeren for innhold",
  "Visual Studio Code":"Visual Studio-kode",
  "We collect your GitHub user name and will display it together with your libraries.":"Vi samler GitHub brukernavnet ditt og vil vises sammen med bibliotekene.",
  "We'll use your GitHub user name":"Vi vil bruke brukernavnet GitHub",
  "Why do you find it offensive?":"Hvorfor finner du det støtende?",
  "You are now signed out from Programming Experience Toolkit":"Du har nå logget ut fra programmering erfaring Toolkit",
  "You can go back to":"Du kan gå tilbake til",
  "You can still create scripts and":"Du kan fremdeles opprette skript og",
  "code the micro:bit":"koden mikro: litt",
  "contact us":"Kontakt oss",
  "explore PXT":"Utforsk PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg",
  "micro:bit":"Micro: bit",
  "or":"eller",
  "pxt.io":"pxt.io",
  "report abuse":"Rapporter misbruk",
  "search docs...":"Søk dokumenter...",
  "sign in again":"logge på igjen",
  "to save scripts to all your devices.":"Lagre skript alle enhetene.",
  "tutorial":"opplæringen",
  "view":"Vis",
  "© 2016 Microsoft":"© 2016 Microsoft"
}