{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# Nyiss egy parancssort, és fuss ezeket a parancsokat, pxt kivonat, https:\/\/codethemicrobit.com\/@id@ cd @title @ kód.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). A tapasztalat van egy beépített progresszió egyszerű blokk alapú szerkesztő segítségével a böngésző szöveg szerkesztő-val erős kocsi-befejezés és auto-rögzítő, egészen a szakmai, integrált fejlődés environemnt)",
  ", or":", vagy",
  "\/@id@":"a szó \/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"a szó \/thumbnail\/1024\/Vimeo\/@ARGS @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You megoszthatja a rendszeres parancsfájlok, bejelentkezés a in.<\/b> csak akkor kell jelentkezzen be, ha szeretné publikálni csomagok (könyvtárak)-hoz lenni használt mások által nélkül. Bejelentkezni, szüksége lesz egy GitHub venni, ami csak 13 és annál idősebb személyek.",
  "@name@ \/@id@":"a szó @name @ a szó \/@id @",
  "@title@ @byuser@":"@title @ a szó @byuser @",
  "About":"Körülbelül",
  "About PXT":"Körülbelül PXT",
  "Block Editor":"Blokkszerkesztő",
  "Build your programming experience":"Építeni a programozási tapasztalat",
  "CSV":"CSV",
  "Cancel":"Mégse",
  "Click on <b>Close &amp; Load<\/b>.":"Kattintson a <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Kattintson a <b>Data<\/b>» <b>New Query<\/b>» <b>From többi Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Összeegyeztethető-val <b>BBC micro: bit<\/b>",
  "Contact Us":"Lépjen kapcsolatba velünk",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Irányítsd a Kodu a mikro: kis! Karakter mozgás, a gyorsulásmérő segítségével irányítani, ugrik és lő egy gombnyomással, animációk megjelenítésére és tekerő szöveg-ra a képernyő felület más eszközök révén a IO csapok, és sok több.",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Hozzon létre egy <b>Blank Workbook<\/b> Excel 2016-ban",
  "Do you need help installing the tools?":"Az eszközök telepítése segítségre van szüksége?",
  "Download Kodu!":"Letölt Kodu!",
  "Edit":"Szerkesztése",
  "Edit in":"Szerkesztés",
  "Embed":"Beágyazása",
  "Enter the following URL and click on <b>Connect<\/b>.":"Írja be a következő URL és kettyenés-ra <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Egy hívás, hogy belül a láblécben, amely segíthet, hogy újra részt felhasználók extra helyet.",
  "Follow these instructions!":"Kövesse ezeket az utasításokat!",
  "Footer Header":"Élőfej élőláb",
  "Get & Transform":"Get & alakítás",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Ismerkedjen meg a kezdő barát drag&amp;drop kód szerkesztő.",
  "GitHub":"GitHub",
  "Group 1":"1. csoport",
  "Group 2":"2. csoport",
  "Group 3":"3 csoport",
  "Houston, we have a problem.":"Houston, van egy kis probléma.",
  "I Agree":"egyetértek",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Hozzájárul ahhoz, hogy az én GitHub felhasználói név <b> @USERNAME@<\/b> kísérő minden könyvtár teszek közzé",
  "I don't agree":"Nem értek egyet",
  "JSON":"JSON",
  "JavaScript Editor":"JavaScript szerkesztő",
  "Kodu for micro:bit":"Kodu mikro: kicsit",
  "Learn more":"tudj meg többet",
  "Link Four":"Négy link",
  "Link One":"Egy link",
  "Link Three":"Link három",
  "Link Two":"Két link",
  "Live data powered by":"Energiát termelő mellett élő adatok",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Győződjön meg róla, akkor jelentkezzen ki a Facebook, az Office 365 szolgáltatásban, a Microsoft vagy a Google, ha-a ' egy közösen használt számítógépen.",
  "OK":"oké",
  "PXT":"PXT",
  "PXT - @name@":"PXT - a szó @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - bejelentkezés",
  "PXT - Signed out":"PXT - kijelentkezve",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"PXT célok, beleértve a BBC micro: kicsit, egy-egy felhasználók blokkok és JavaScript API-k rendelkezésére határoznak meg. Tanárok és a fejlesztők is kiterjeszteni a meglévő célok kiadói csomagok vagy könyvtárak-val további blokkok és API-k, valamint a teljesen új célok építeni.",
  "Powered by PXT":"Powered by PXT",
  "Privacy & Cookies":"Adatvédelmi & cookie-k",
  "Programming Experience Toolkit":"Programozási tapasztalat Toolkit",
  "Programming Experience Toolkit Logo":"Programozási tapasztalat Toolkit logó",
  "Read the docs":"Olvassa el a dokik",
  "Report abuse":"Visszaélés jelentése",
  "Report sent":"Jelentést küldött",
  "Sample":"Minta",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Jelölje ki a <b>Anonymous<\/b> és <b>Connect<\/b>.",
  "Show me the sample!":"Mutasd meg a minta!",
  "Sign in":"bejelentkezés",
  "Start coding":"Kódolás indítása",
  "Stream: @name@":"Adás: @name @",
  "Stream: @name@ \/@id@":"Adás: @name @ a szó \/@id @",
  "Streaming data in Excel 2016":"Áramoltatott adatok Excel 2016-ban",
  "Submit":"Nyújtson be",
  "Targets":"Célok",
  "Terms Of Use":"Felhasználási feltételek",
  "Thank you for helping keep PXT a friendly place!":"Köszönjük, hogy segít megőrizni a PXT egy barátságos hely!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"A Microsoft programozási tapasztalat Toolkit (PXT) köré (technikailag részhalmaza JavaScript programozási élményt nyújt",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"A tartalom az alábbi PXT felhasználó által megadott, és nem jóváhagyott mellett Mikroszkóp. Ha úgy gondolja, nem helyénvaló, kérjük",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Ez patak tárolt adatok könnyedén importálhatók egy Excel 2016 táblázatkezelő segítségével",
  "Trademarks":"Védjegyek",
  "TypeScript":"Géppel",
  "URL":"URL-CÍM",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Feljavít-hoz JavaScript-hála a gazdag szövegszerkesztő a környezetfüggő súgó, a háttér ellenőrzések és az automatikus kiegészítést.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Használja PXT, hogy egy sima kódolási tapasztalat a projekthez, a blokkok és a JavaScript. Épít a API-k és a futási idő, és mi gondoskodunk a szerkesztő cucc.",
  "User-provided content":"Felhasználó által biztosított tartalomnak",
  "Visual Studio Code":"Kód a Visual Studio",
  "We collect your GitHub user name and will display it together with your libraries.":"Gyűjtünk GitHub felhasználói neved, és akarat bemutatás együtt a könyvtárak.",
  "We'll use your GitHub user name":"Fogjuk használni a GitHub felhasználónevét",
  "Why do you find it offensive?":"Miért nem találja támadó?",
  "You are now signed out from Programming Experience Toolkit":"Most jelentkezünk a programozási tapasztalat Toolkit",
  "You can go back to":"Mehetsz vissza, hogy",
  "You can still create scripts and":"Még mindig olyan parancsfájlokat hozhat létre és",
  "code the micro:bit":"a micro: darab kód",
  "contact us":"lépjen kapcsolatba velünk",
  "explore PXT":"Fedezze fel a PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/VI\/@ARGS@\/hqdefault.jpg",
  "micro:bit":"Micro: bit",
  "or":"vagy",
  "pxt.io":"pxt.IO",
  "report abuse":"Visszaélés jelentése",
  "search docs...":"keresési docs...",
  "sign in again":"Jelentkezzen be újra",
  "to save scripts to all your devices.":"parancsfájlok menteni a berendezés.",
  "tutorial":"a bemutató",
  "view":"nézet",
  "© 2016 Microsoft":"© 2016 Microsoft"
}