{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# aprire una shell ed eseguire questi comandi pxt estrarre https:\/\/codethemicrobit.com\/@id@ cd @title @ codice.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). L'esperienza ha una built-in progressione da semplice editor basato su blocchi, tramite editor di testo nel browser con robusto completamento automatico e auto-fissaggio, fino a un professionale sviluppo integrato environemnt (",
  ", or":", o",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/Thumbnail\/1024\/Vimeo\/@args @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You puoi condividere il tuo script normali senza firma in.<\/b> che è necessario solo se si desidera pubblicare i pacchetti (librerie) per essere utilizzato da altri utenti l'accesso. Per accedere, è necessario un account GitHub, che è disponibile solo per persone 13 e più vecchi.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "About":"Circa",
  "About PXT":"Su PXT",
  "Block Editor":"Editor blocchi",
  "Build your programming experience":"Costruire l'esperienza di programmazione",
  "CSV":"CSV",
  "Cancel":"Annulla",
  "Click on <b>Close &amp; Load<\/b>.":"Fare clic su <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Fare clic su <b>Data<\/b>» <b>New Query<\/b>» <b>From altri Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Compatibile con micro <b>BBC: bit<\/b>",
  "Contact Us":"Contattaci",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Controllare il vostro Kodu con il micro: bit! Si può controllare il movimento di carattere utilizzando l'accelerometro, saltare e sparare con una pressione del pulsante, visualizzare animazioni e testo sullo schermo, a scorrimento di interfaccia con altri dispositivi tramite i pin di IO e molto altro ancora...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Creare un Workbook<\/b> di <b>Blank in Excel 2016",
  "Do you need help installing the tools?":"Avete bisogno di aiuto per installare gli strumenti?",
  "Download Kodu!":"Scarica Kodu!",
  "Edit":"Modifica",
  "Edit in":"Modificare in",
  "Embed":"Incorpora",
  "Enter the following URL and click on <b>Connect<\/b>.":"Immettere l'URL seguente e fare clic su <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Spazio extra per un invito all'azione all'interno del piè di pagina che potrebbe aiutare a ri-coinvolgere gli utenti.",
  "Follow these instructions!":"Seguire queste istruzioni!",
  "Footer Header":"Piè di pagina intestazione",
  "Get & Transform":"Get & Transform",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Cominciate con un editor di codice di principiante amichevole drag&amp;drop.",
  "GitHub":"GitHub",
  "Group 1":"Gruppo 1",
  "Group 2":"Gruppo 2",
  "Group 3":"Gruppo 3",
  "Houston, we have a problem.":"Houston, abbiamo un problema.",
  "I Agree":"Sono d'accordo",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Esprimo il consenso al mio GitHub utente nome di <b> @USERNAME@<\/b> che accompagna qualsiasi libreria di che pubblicare",
  "I don't agree":"Non sono d'accordo",
  "JSON":"JSON",
  "JavaScript Editor":"Editor JavaScript",
  "Kodu for micro:bit":"Kodu per micro: bit",
  "Learn more":"Ulteriori informazioni",
  "Link Four":"Collegare quattro",
  "Link One":"Collegare uno",
  "Link Three":"Collegare tre",
  "Link Two":"Collegare due",
  "Live data powered by":"Arricchito con dati in tempo reale",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Assicurarsi che esci da Facebook, Office 365, Microsoft o Google se sei su un computer condiviso.",
  "OK":"Ok",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - Sign in",
  "PXT - Signed out":"PXT - disconnesso",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"PXT destinazioni, tra cui uno per il BBC micro: bit, definiscono un insieme di blocchi e JavaScript APIs disponibile agli utenti. Gli insegnanti e gli sviluppatori possono estendere gli obiettivi esistenti da editrice pacchetti o librerie con ulteriori blocchi e API nonché compilare completamente nuove destinazioni.",
  "Powered by PXT":"Powered by PXT",
  "Privacy & Cookies":"Privacy e cookie",
  "Programming Experience Toolkit":"Toolkit di esperienza di programmazione",
  "Programming Experience Toolkit Logo":"Logo di programmazione Experience Toolkit",
  "Read the docs":"Leggere la documentazione",
  "Report abuse":"Segnala un abuso",
  "Report sent":"Report inviato",
  "Sample":"Campione",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Selezionare <b>Anonymous<\/b> e fare clic su <b>Connect<\/b>.",
  "Show me the sample!":"Mostrami il campione!",
  "Sign in":"Accedi",
  "Start coding":"Iniziare a scrivere codice",
  "Stream: @name@":"Streaming: @name @",
  "Stream: @name@ \/@id@":"Streaming: @name @ \/@id @",
  "Streaming data in Excel 2016":"Flusso di dati in Excel 2016",
  "Submit":"Invia",
  "Targets":"Obiettivi",
  "Terms Of Use":"Termini di utilizzo",
  "Thank you for helping keep PXT a friendly place!":"Grazie per averci aiutato a mantenere PXT un luogo amichevole!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"Microsoft programmazione esperienza Toolkit (PXT) fornisce un'esperienza di programmazione basata su JavaScript (tecnicamente, un sottoinsieme di",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Il contenuto sottostante è fornito da un utente PXT e non è approvato da Microsoft. Se pensi che non è opportuno, per favore",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"I dati memorizzati in questo flusso possono essere facilmente importati in un foglio di calcolo Excel 2016 utilizzando",
  "Trademarks":"Marchi di fabbrica",
  "TypeScript":"Dattiloscritto",
  "URL":"URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Eseguire l'aggiornamento a JavaScript grazie al nostro editor di testo RTF con aiuto contestuale, controlli in background e completamento automatico.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Utilizzare PXT per fornire un'esperienza di codifica uniforme per il progetto, in blocchi e JavaScript. Costruire le API e il runtime e noi ci occuperemo della roba editor.",
  "User-provided content":"Contenuto fornito dall'utente",
  "Visual Studio Code":"Codice di Visual Studio",
  "We collect your GitHub user name and will display it together with your libraries.":"Raccogliamo il tuo nome utente su GitHub e verrà visualizzato insieme con le librerie.",
  "We'll use your GitHub user name":"Useremo il tuo nome utente di GitHub",
  "Why do you find it offensive?":"Perché lo trovi offensivo?",
  "You are now signed out from Programming Experience Toolkit":"Ora sei registrato dalla programmazione Experience Toolkit",
  "You can go back to":"Si può tornare indietro per",
  "You can still create scripts and":"È comunque possibile creare script e",
  "code the micro:bit":"codice il micro: bit",
  "contact us":"contattaci",
  "explore PXT":"Esplora PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/vi\/@args@\/hqdefault.jpg",
  "micro:bit":"Micro: bit",
  "or":"o",
  "pxt.io":"PXT.io",
  "report abuse":"Segnala un abuso",
  "search docs...":"ricerca di documenti...",
  "sign in again":"eseguire nuovamente l'accesso",
  "to save scripts to all your devices.":"per salvare gli script di tutti i tuoi dispositivi.",
  "tutorial":"Tutorial",
  "view":"vista",
  "© 2016 Microsoft":"© Microsoft 2016"
}