{
  ", or":", o",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/Thumbnail\/1024\/Vimeo\/@args @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You puoi condividere il tuo script normali senza firma in.<\/b> che è necessario solo se si desidera pubblicare i pacchetti (librerie) per essere utilizzato da altri utenti l'accesso. Per accedere, è necessario un account GitHub, che è disponibile solo per persone 13 e più vecchi.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "A Kinder JavaScript Experience":"Un'esperienza di JavaScript Kinder",
  "About":"Circa",
  "Blocks Editor":"Editor di blocchi",
  "Blocks to JavaScript coding experience":"Blocchi per esperienza di codifica JavaScript",
  "Build your own libraries":"Costruire le proprie librerie",
  "Build your own targets":"Costruire i propri obiettivi",
  "CSV":"CSV",
  "Cancel":"Annulla",
  "Click on <b>Close &amp; Load<\/b>.":"Fare clic su <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Fare clic su <b>Data<\/b>» <b>New Query<\/b>» <b>From altri Sources<\/b>» <b>From Web<\/b>.",
  "Contact Us":"Contattaci",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Creare un Workbook<\/b> di <b>Blank in Excel 2016",
  "Embed":"Incorpora",
  "Enter the following URL and click on <b>Connect<\/b>.":"Immettere l'URL seguente e fare clic su <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Spazio extra per un invito all'azione all'interno del piè di pagina che potrebbe aiutare a ri-coinvolgere gli utenti.",
  "Footer Header":"Piè di pagina intestazione",
  "Fork":"Forcella",
  "Get & Transform":"Get & Transform",
  "Get Started!":"Per iniziare!",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Cominciate con un editor di codice di principiante amichevole drag&amp;drop.",
  "GitHub":"GitHub",
  "Group 1":"Gruppo 1",
  "Group 2":"Gruppo 2",
  "Group 3":"Gruppo 3",
  "Hint":"Suggerimento",
  "Houston, we have a problem.":"Houston, abbiamo un problema.",
  "I Agree":"Sono d'accordo",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Esprimo il consenso al mio GitHub utente nome di <b> @USERNAME@<\/b> che accompagna qualsiasi libreria di che pubblicare",
  "I don't agree":"Non sono d'accordo",
  "JSON":"JSON",
  "JavaScript Editor":"Editor JavaScript",
  "Link Four":"Collegare quattro",
  "Link One":"Collegare uno",
  "Link Three":"Collegare tre",
  "Link Two":"Collegare due",
  "Live data.":"Dati in tempo reale.",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Assicurarsi che esci da Facebook, Office 365, Microsoft o Google se sei su un computer condiviso.",
  "OK":"Ok",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - Sign in",
  "PXT - Signed out":"PXT - disconnesso",
  "PXT for micro:bit":"PXT per micro: bit",
  "PXT supports a modern packaging system that allows developer to add their own blocks and JavaScript APIs to the coding experience.":"PXT supporta un sistema di packaging moderno che permette allo sviluppatore di aggiungere i propri blocchi e JavaScript APIs per l'esperienza di codifica.",
  "Powered by PXT":"Powered by PXT",
  "Privacy & Cookies":"Privacy e cookie",
  "Programming Experience Toolkit":"Toolkit di esperienza di programmazione",
  "Programming Experience Toolkit (PXT) provides an programming experience based around JavaScript (technically, a subset of TypeScript). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (Visual Studio Code).":"Esperienza Toolkit (PXT) di programmazione fornisce un'esperienza di programmazione basato su JavaScript (tecnicamente, un sottoinsieme del dattiloscritto). L'esperienza ha una built-in progressione da semplice editor basato su blocchi, tramite editor di testo nel browser con robusto completamento automatico e auto-fissaggio, fino a un professionale sviluppo integrato environemnt (codice di Visual Studio).",
  "Programming Experience Toolkit Logo":"Logo di programmazione Experience Toolkit",
  "Report abuse":"Segnala un abuso",
  "Report sent":"Report inviato",
  "Sample":"Campione",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Selezionare <b>Anonymous<\/b> e fare clic su <b>Connect<\/b>.",
  "Show me a package!":"Mostrami un pacchetto!",
  "Show me the sample!":"Mostrami il campione!",
  "Sign in":"Accedi",
  "Start coding micro:bit":"Iniziare a scrivere codice micro: bit",
  "Stream: @name@":"Streaming: @name @",
  "Stream: @name@ \/@id@":"Streaming: @name @ \/@id @",
  "Streaming data in Excel 2016":"Flusso di dati in Excel 2016",
  "Submit":"Invia",
  "Targets":"Obiettivi",
  "Terms Of Use":"Termini di utilizzo",
  "Thank you for helping keep PXT a friendly place!":"Grazie per averci aiutato a mantenere PXT un luogo amichevole!",
  "The BBC micro:bit is a small wearable and programmable mbed-based device that visibly features a 5x5 LED display, accelerometer, compass, buttons, I\/O pins, Micro USB plug, Bluetooth Low Energy antenna, ARM Cortex-M0 processor, and battery plug. PXT will let you program it!":"Il BBC micro: bit è un piccolo portabile e programmabile basato su mbed dispositivo che visibilmente dispone di un display a LED 5x5, accelerometro, bussola, pulsanti, pin i\/o, connettore Micro USB, antenna Bluetooth Low Energy, processore ARM Cortex-M0 e spina della batteria. PXT vi permetterà di programmare!",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Il contenuto sottostante è fornito da un utente PXT e non è approvato da Microsoft. Se pensi che non è opportuno, per favore",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"I dati memorizzati in questo flusso possono essere facilmente importati in un foglio di calcolo Excel 2016 utilizzando",
  "Trademarks":"Marchi di fabbrica",
  "URL":"URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Eseguire l'aggiornamento a JavaScript grazie al nostro editor di testo RTF con aiuto contestuale, controlli in background e completamento automatico.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and javascript. Build the APIs and the runtime and we will take care of the editor stuff.":"Utilizzare PXT per fornire un'esperienza di codifica uniforme per il progetto, in blocchi e javascript. Costruire le API e il runtime e noi ci occuperemo della roba editor.",
  "User-provided content":"Contenuto fornito dall'utente",
  "We collect your GitHub user name and will display it together with your libraries.":"Raccogliamo il tuo nome utente su GitHub e verrà visualizzato insieme con le librerie.",
  "We'll use your GitHub user name":"Useremo il tuo nome utente di GitHub",
  "Why do you find it offensive?":"Perché lo trovi offensivo?",
  "You are now signed out from Programming Experience Toolkit":"Ora sei registrato dalla programmazione Experience Toolkit",
  "You can go back to":"Si può tornare indietro per",
  "You can still create scripts and":"È comunque possibile creare script e",
  "contact us":"contattaci",
  "explore PXT":"Esplora PXT",
  "https:\/\/az851932.vo.msecnd.net\/pub\/vzprhahi\/microbit.red.svg":"https:\/\/az851932.vo.msecnd.net\/pub\/vzprhahi\/microbit.Red.svg",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/vi\/@args@\/hqdefault.jpg",
  "https:\/\/www.microbit.co.uk\/@ARGS@\/thumb":"https:\/\/www.microbit.co.uk\/@args@\/Thumb",
  "micro:bit":"Micro: bit",
  "or":"o",
  "pxt.io":"PXT.io",
  "report abuse":"Segnala un abuso",
  "search docs...":"ricerca di documenti...",
  "sign in again":"eseguire nuovamente l'accesso",
  "to save scripts to all your devices.":"per salvare gli script di tutti i tuoi dispositivi.",
  "tutorial":"Tutorial",
  "view":"vista",
  "© 2016 Microsoft":"© Microsoft 2016"
}