{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# Otevřete shell a spusťte tyto příkazy pxt extrahovat https:\/\/codethemicrobit.com\/@id@ cd @title @ kódu.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). Zkušenosti má vestavěný postup od jednoduchého editoru blocích, prostřednictvím prohlížeče textový editor s robustní auto dokončení a auto upevnění, až po profesionální integrovaného rozvoje environemnt (",
  ", or":", nebo",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/Thumbnail\/1024\/Vimeo\/@args @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You mohou sdílet své pravidelné skripty bez podpisu in.<\/b>, kterou stačí pouze přihlásit, pokud chcete publikovat balíčky (knihovny) používat ostatní uživatelé. Chcete-li přihlásit, budete potřebovat účet GitHub, která je dostupná pouze pro osoby starší a 13.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "About":"O",
  "About PXT":"O PXT",
  "Block Editor":"Editor bloků",
  "Build your programming experience":"Budovat své zkušenosti s programováním",
  "CSV":"CSV",
  "Cancel":"Zrušit",
  "Click on <b>Close &amp; Load<\/b>.":"Klepněte na <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Klepněte na <b>Data<\/b>» <b>New Query<\/b>» <b>From jiné Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Kompatibilní s <b>BBC micro: bit<\/b>",
  "Contact Us":"Kontaktujte nás",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Ovládat své Kodu s mikro: bit! Můžete ovládat pohyb postavy pomocí akcelerometru, skok a střílet s tlačítko Tisk, zobrazení animací a posouvaný text na obrazovce, propojení s jinými zařízeními prostřednictvím IO vývody a mnohem více...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Vytvoření <b>Blank Workbook<\/b> v aplikaci Excel 2016",
  "Do you need help installing the tools?":"Potřebujete pomoci s instalací nástroje?",
  "Download Kodu!":"Zavádění Kodu!",
  "Edit":"Úpravy",
  "Edit in":"Úpravy v",
  "Embed":"Vložit",
  "Enter the following URL and click on <b>Connect<\/b>.":"Zadejte následující adresu URL a klepněte na <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Navíc prostor pro výzvu k akci v zápatí, které by mohly pomoci znovu zapojit uživatele.",
  "Follow these instructions!":"Postupujte podle těchto pokynů.",
  "Footer Header":"Zápatí záhlaví",
  "Get & Transform":"Get & transformace",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Začínáme s editor kódu přátelské drag&amp;drop začátečník.",
  "GitHub":"GitHub",
  "Group 1":"Skupina 1",
  "Group 2":"Skupina 2",
  "Group 3":"Skupina 3",
  "Houston, we have a problem.":"Houstone, máme problém.",
  "I Agree":"Souhlasím",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Jsem souhlas k mé GitHub uživatelské jméno <b> @USERNAME@<\/b> doprovázející knihovnu, publikovat",
  "I don't agree":"Já nesouhlasím",
  "JSON":"JSON",
  "JavaScript Editor":"Editor JavaScriptu",
  "Kodu for micro:bit":"Kodu pro mikro: bit",
  "Learn more":"Víc se uč",
  "Link Four":"Propojit čtyři",
  "Link One":"Jeden odkaz",
  "Link Three":"Propojit tři",
  "Link Two":"Propojit dva",
  "Live data powered by":"Živá data poháněné",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Zkontrolujte, zda že přihlášení Facebook, Office 365, Microsoft nebo Google, pokud jste na sdíleném počítači.",
  "OK":"Ok",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - přihlásit se",
  "PXT - Signed out":"PXT - odhlášení",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"PXT cílů, včetně jednoho pro BBC micro: bit, definovat sadu bloků a JavaScript API k dispozici uživatelům. Učitelé a vývojáři mohou rozšířit stávající cíle publikování balíčků nebo knihovny s API a další bloky stejně jako vybudovat zcela nové cíle.",
  "Powered by PXT":"Poháněn PXT",
  "Privacy & Cookies":"Soukromí & soubory cookie",
  "Programming Experience Toolkit":"Programování zkušenosti Toolkit",
  "Programming Experience Toolkit Logo":"Programování zkušenosti Toolkit Logo",
  "Read the docs":"Přečtěte si dokumenty",
  "Report abuse":"Ohlásit příspěvek jako urážlivý",
  "Report sent":"Zpráva odeslána",
  "Sample":"Ukázka",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Vyberte <b>Anonymous<\/b> a klepněte na tlačítko <b>Connect<\/b>.",
  "Show me the sample!":"Ukaž mi vzorek!",
  "Sign in":"Přihlásit se",
  "Start coding":"Spustit kódování",
  "Stream: @name@":"Proud: @name @",
  "Stream: @name@ \/@id@":"Proud: @name @ \/@id @",
  "Streaming data in Excel 2016":"Streamování dat v aplikaci Excel 2016",
  "Submit":"Odeslat",
  "Targets":"Cíle",
  "Terms Of Use":"Podmínky užití",
  "Thank you for helping keep PXT a friendly place!":"Děkujeme vám za pomoc, aby PXT přátelské místo!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"Microsoft programování zkušenosti Toolkit (PXT) poskytuje programátorské zkušenosti založené kolem JavaScript (technicky, dílčí",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"Uvedený obsah poskytuje PXT uživatelem a není schválen společností Microsoft. Pokud si myslíte, že to není vhodné, prosím",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Data uložená v tomto proudu lze snadno importovat do tabulky pomocí aplikace Excel 2016",
  "Trademarks":"Ochranné známky",
  "TypeScript":"Strojopis",
  "URL":"ADRESA URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Upgrade na JavaScript díky naší bohatý textový editor s ostrostí, ověření spolehlivosti a automatické dokončování.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Použití PXT hladký kódovací zkušeností pro váš projekt, v blocích a JavaScript. API a runtime a my se postaráme o editoru věci.",
  "User-provided content":"Obsah poskytnutý uživateli",
  "Visual Studio Code":"Kód aplikace Visual Studio",
  "We collect your GitHub user name and will display it together with your libraries.":"Sbíráme vaše uživatelské jméno GitHub a zobrazí ji spolu s vaší knihovny.",
  "We'll use your GitHub user name":"Budeme používat GitHub uživatelské jméno",
  "Why do you find it offensive?":"Proč najdete ji urážlivý?",
  "You are now signed out from Programming Experience Toolkit":"Jste teď odhlášeni od programování Toolkit zkušenosti",
  "You can go back to":"Můžete se vrátit do",
  "You can still create scripts and":"Stále můžete vytvářet skripty a",
  "code the micro:bit":"kód micro: bit",
  "contact us":"kontaktujte nás",
  "explore PXT":"Prozkoumejte PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/VI\/@args@\/hqdefault.jpg",
  "micro:bit":"mikro: bit",
  "or":"nebo",
  "pxt.io":"pxt.IO",
  "report abuse":"Ohlásit příspěvek jako urážlivý",
  "search docs...":"Hledat dokumenty...",
  "sign in again":"znovu přihlásit",
  "to save scripts to all your devices.":"Chcete-li uložit skripty pro všechna vaše zařízení.",
  "tutorial":"Výukový program",
  "view":"pohled",
  "© 2016 Microsoft":"© 2016 Microsoft"
}