{
  "# open a shell and run these commands pxt extract https:\/\/codethemicrobit.com\/@id@ cd @title@ code .":"# Abra um shell e executar esses comandos pxt extrair cd https:\/\/codethemicrobit.com\/@id@ @title @ código.",
  "). The experience has a built-in progression from simple block-based editor, through in-browser text editor with robust auto-completion and auto-fixing, all the way to a professional integrated development environemnt (":"). A experiência tem uma progressão built-in do editor simples baseada em blocos, através de editor de texto no navegador com preenchimento automático robusto e auto-fixação, todo o caminho para um desenvolvimento integrado profissional environemnt (",
  ", or":", ou",
  "\/@id@":"\/@id @",
  "\/thumbnail\/1024\/vimeo\/@ARGS@":"\/thumbnail\/1024\/Vimeo\/@args @",
  "<b>You can share your regular scripts without signing in.<\/b> You only need to sign in if you wish to publish packages (libraries) to be used by others. To sign in, you will need a GitHub account, which is only available to persons 13 and older.":"<b>You pode compartilhar seus scripts regulares sem assinar in.<\/b> que você só precisa entrar se você deseja publicar pacotes (bibliotecas) para ser usado por outros. Para logar, você precisará de uma conta de GitHub, que está disponível apenas para pessoas mais velhas e 13.",
  "@name@ \/@id@":"@name @ \/@id @",
  "@title@ @byuser@":"@title @ @byuser @",
  "About":"Sobre",
  "About PXT":"Sobre PXT",
  "Block Editor":"Editor de bloco",
  "Build your programming experience":"Construir sua experiência de programação",
  "CSV":"CSV",
  "Cancel":"Cancelar",
  "Click on <b>Close &amp; Load<\/b>.":"Clique no <b>Close &amp; Load<\/b>.",
  "Click on <b>Data<\/b> » <b>New Query<\/b> » <b>From Other Sources<\/b> » <b>From Web<\/b>.":"Clique no <b>Data<\/b>» <b>New Query<\/b>» <b>From outros Sources<\/b>» <b>From Web<\/b>.",
  "Compatible with <b>BBC micro:bit<\/b>":"Compatível com <b>BBC micro: bit<\/b>",
  "Contact Us":"Contate-nos",
  "Control your Kodu with the micro:bit! You can control character movement using the accelerometer, jump and shoot with a button press, display animations and scrolling text on the screen, interface with other devices through the IO pins, and much more..":"Controle seu Kodu com o micro: pouco! Você pode controlar o movimento do personagem usando o acelerômetro, pular e atirar com pressionar um botão, exibir animações e rolagem de texto na tela, interface com outros dispositivos através dos pinos de IO e muito mais...",
  "Create a <b>Blank Workbook<\/b> in Excel 2016":"Criar um Workbook<\/b> de <b>Blank de Excel 2016",
  "Do you need help installing the tools?":"Precisa de ajuda instalando as ferramentas?",
  "Download Kodu!":"Baixe o Kodu!",
  "Edit":"Editar",
  "Edit in":"Editar em",
  "Embed":"Incorporar",
  "Enter the following URL and click on <b>Connect<\/b>.":"Digite a seguinte URL e clique em <b>Connect<\/b>.",
  "Extra space for a call to action inside the footer that could help re-engage users.":"Espaço extra para uma chamada à ação dentro o rodapé que poderia ajudar a re-envolver os usuários.",
  "Follow these instructions!":"Siga estas instruções!",
  "Footer Header":"Cabeçalho rodapé",
  "Get & Transform":"Obter & Transform",
  "Get started with a beginner friendly drag&amp;drop code editor.":"Começar com um editor de código do iniciante drag&amp;drop amigável.",
  "GitHub":"GitHub",
  "Group 1":"Grupo 1",
  "Group 2":"Grupo 2",
  "Group 3":"Grupo 3",
  "Houston, we have a problem.":"Houston, temos um problema.",
  "I Agree":"Aceito",
  "I consent to my GitHub user name <b>@USERNAME@<\/b> accompanying any library I publish":"Consinto meu GitHub usuário nome <b> @USERNAME@<\/b> que acompanha qualquer biblioteca que eu publicar",
  "I don't agree":"Eu não concordo",
  "JSON":"JSON",
  "JavaScript Editor":"Editor de JavaScript",
  "Kodu for micro:bit":"Kodu para micro: bit",
  "Learn more":"Saiba Mais",
  "Link Four":"Link quatro",
  "Link One":"Vincular um",
  "Link Three":"Ligação a três",
  "Link Two":"Ligação de dois",
  "Live data powered by":"Alimentado por dados em tempo real",
  "Make sure you log out of Facebook, Office 365, Microsoft or Google if you're on a shared computer.":"Certifique-se de que você fazer logon sair Facebook ou Google, Microsoft, Office 365, se você estiver em um computador compartilhado.",
  "OK":"Okey",
  "PXT":"PXT",
  "PXT - @name@":"PXT - @name @",
  "PXT - @title@":"PXT - @title @",
  "PXT - Sign in":"PXT - sinal em",
  "PXT - Signed out":"PXT - assinado",
  "PXT targets, including one for the BBC micro:bit, define a set of blocks and JavaScript APIs available to users. Teachers and developers can extend existing targets by publishing packages or libraries with additional blocks and APIs as well as build completely new targets.":"Alvos PXT, incluindo uma para o BBC micro: bit, definem um conjunto de blocos e JavaScript APIs disponíveis para os usuários. Professores e desenvolvedores podem estender os alvos existentes por publicação pacotes ou bibliotecas com blocos adicionais e APIs bem como completamente novos destinos de compilação.",
  "Powered by PXT":"Alimentado por PXT",
  "Privacy & Cookies":"Privacidade & Cookies",
  "Programming Experience Toolkit":"Kit de ferramentas de programação experiência",
  "Programming Experience Toolkit Logo":"Logotipo de Toolkit de experiência de programação",
  "Read the docs":"Leia os docs",
  "Report abuse":"Relatar abuso",
  "Report sent":"Relatório enviado",
  "Sample":"Amostra",
  "Select <b>Anonymous<\/b> and click <b>Connect<\/b>.":"Selecione <b>Anonymous<\/b> e clique em <b>Connect<\/b>.",
  "Show me the sample!":"Mostre-me a amostra!",
  "Sign in":"Entrar",
  "Start coding":"Iniciar a codificação",
  "Stream: @name@":"Fluxo: @name @",
  "Stream: @name@ \/@id@":"Fluxo: @name @ \/@id @",
  "Streaming data in Excel 2016":"Transmissão de dados em Excel 2016",
  "Submit":"Enviar",
  "Targets":"Metas",
  "Terms Of Use":"Termos de uso",
  "Thank you for helping keep PXT a friendly place!":"Obrigado por ajudar a manter PXT é um lugar amigável!",
  "The Microsoft Programming Experience Toolkit (PXT) provides a programming experience based around JavaScript (technically, a subset of":"A Microsoft programação experiência Toolkit (PXT) fornece uma experiência de programação baseada em JavaScript (tecnicamente, um subconjunto de",
  "The content below is provided by a PXT user, and is not endorsed by Microsoft. If you think it's not appropriate, please":"O conteúdo abaixo é fornecido por um usuário PXT e não é endossado pela Microsoft. Se você acha que não é apropriado, por favor",
  "The data stored in this stream can easily be imported into an Excel 2016 spreadsheet using":"Os dados armazenados nesta corrente facilmente podem ser importados usando uma planilha de Excel 2016",
  "Trademarks":"Marcas comerciais",
  "TypeScript":"Máquina de escrever",
  "URL":"URL",
  "Upgrade to JavaScript thanks to our rich text editor with contextual help, background checks and auto-completion.":"Atualizar para JavaScript graças ao nosso editor de rich text com ajuda contextual, verificação de antecedentes e preenchimento automático.",
  "Use PXT to provide a smooth coding experience for your project, in blocks and JavaScript. Build the APIs and the runtime and we will take care of the editor stuff.":"Use PXT para fornecer uma experiência de codificação suave para o seu projeto, em blocos e JavaScript. Construir as APIs e o tempo de execução e vamos cuidar do material editor.",
  "User-provided content":"Conteúdo fornecido pelo usuário",
  "Visual Studio Code":"Código do Visual Studio",
  "We collect your GitHub user name and will display it together with your libraries.":"Coletamos seu nome de usuário do GitHub e exibi-lo em conjunto com suas bibliotecas.",
  "We'll use your GitHub user name":"Nós vamos usar seu nome de usuário do GitHub",
  "Why do you find it offensive?":"Por que você acha isso ofensivo?",
  "You are now signed out from Programming Experience Toolkit":"Você agora está conectado do kit de ferramentas de experiência de programação",
  "You can go back to":"Você pode voltar para",
  "You can still create scripts and":"Você ainda pode criar scripts e",
  "code the micro:bit":"código do micro: pouco",
  "contact us":"Contate-nos",
  "explore PXT":"explorar PXT",
  "https:\/\/img.youtube.com\/vi\/@ARGS@\/hqdefault.jpg":"https:\/\/img.youtube.com\/vi\/@args@\/hqdefault.jpg",
  "micro:bit":"micro: bit",
  "or":"ou",
  "pxt.io":"PXT.Io",
  "report abuse":"relatar abuso",
  "search docs...":"documentos de pesquisa...",
  "sign in again":"Cadastre-se novo",
  "to save scripts to all your devices.":"para salvar os scripts para todos os seus dispositivos.",
  "tutorial":"tutorial",
  "view":"modo de exibição",
  "© 2016 Microsoft":"© 2016 Microsoft"
}